import fetch from 'node-fetch';

const maxRetries = 3;
const retryDelay = 10000; // jeda 10 detik

let handler = async (m, { args, usedPrefix, command }) => {
    const daftarsurah = `${mssg.example}:
.alquran 1 2

surah number and ayat number e.g .alqruan 36 1 this is surah Yaseen Ayat Number 1 

then the result is surah Al-Fatihah verse 2 and its audio, & verse 1 only
پھر اس کا نتیجہ سورۂ فاتحہ آیت 2 اور اس کی آڈیو اور صرف آیت 1 ہے۔ 

سورہ کے نام:

1. سورہ الفاتحة (سورۃ الفاتحہ)، 7 آیات | مكة
سورہ فاتحہ جو مکہ میں نازل ہوئی اور 7 آیات پر مشتمل ہے قرآن کے حروف میں سے مکمل طور پر نازل ہونے والا پہلا حرف ہے اور مکیہ سورہ گروپ میں شامل ہے۔ اس حرف کو الفاتحہ کہتے ہیں کیونکہ اس حرف سے قرآن کھلتا اور شروع ہوتا ہے۔ اسے ام القرآن (قرآن کی ماں) یا ام الکتاب (الکتاب کی ماں) کہا جاتا ہے کیونکہ یہ قرآن کے تمام مواد کی ماں ہے، اس لیے اسے ہر نماز میں پڑھنا لازمی ہے۔ اس کو سب المتسانی (سات دہرائے جانے والے) بھی کہا جاتا ہے کیونکہ اس میں سات آیات ہیں اور نماز میں بار بار پڑھی جاتی ہیں۔

2. سورہ البقرة (سورہ البقرہ (گائے))، 286 آیات | مدينة
سورہ بقرہ کی 286 آیات مدینہ منورہ میں نازل ہوئیں، جن میں سے زیادہ تر ہجرت کے سال کے آغاز میں نازل ہوئیں، سوائے آیت 281 کے جو منیٰ میں حجی وداع (پیغمبر اکرم صلی اللہ علیہ وسلم کے آخری حج) پر نازل ہوئی تھی۔ سورہ بقرہ کی تمام آیات مدنی گروپ سے تعلق رکھتی ہیں، یہ قرآن کے حروف میں سب سے لمبا خط ہے جس میں ایک مقررہ آیت (آیت 282) بھی ہے۔ اس خط کو البقرہ کہا جاتا ہے کیونکہ اس میں ایک گائے کے ذبح کی کہانی کا ذکر ہے جس کا اللہ نے بنی اسرائیل کو حکم دیا تھا (آیت 67 تا 74) جہاں عام طور پر یہودیوں کے کردار کی وضاحت کی گئی ہے۔ اس کا نام فصطح القرآن (قرآن کی چوٹی) رکھا گیا ہے کیونکہ اس میں کئی ایسے قوانین ہیں جن کا دوسرے حروف میں ذکر نہیں ہے۔ اسے الف لام میم بھی کہا جاتا ہے کیونکہ یہ حرف الف لام میم سے شروع ہوتا ہے۔

3. سورہ آل عمران (سورہ علی 'عمران (خاندان عمران دی فیملی آف عمران)) 200 آیات | مدينة
سورہ علی عمران جو 200 آیات پر مشتمل ہے ایک مدنی خط ہے۔  اسے علی عمران اس لیے کہا جاتا ہے کہ اس میں خاندانِ عمران کی کہانی ہے، جس میں حضرت عیسیٰ علیہ السلام کی پیدائش کا ذکر ہے، یہ واقعہ حضرت آدم علیہ السلام سے ملتا جلتا ہے۔ s.، نبوت اور متعدد معجزات، اور حضرت عیسیٰ علیہ السلام کی والدہ مریم بنت عمران کی ولادت کا بھی ذکر ہے۔ حروف البقرہ اور علی عمران کو عز زہراوانی کہا جاتا ہے کیونکہ یہ دونوں خطوط ان چیزوں کو ظاہر کرتے ہیں جنہیں اہل کتاب نے پوشیدہ رکھا تھا، جیسے واقعات اور حضرت عیسیٰ علیہ السلام کی ولادت، آمد۔ نبی کریم صلی اللہ علیہ وسلم کی وغیرہ

4. سورہ النساء (سورہ نساء)، 176 آیات | مدينة
سورہ نساء، جو 176 آیات پر مشتمل ہے، سورہ بقرہ کے بعد سب سے لمبی مدنی سورت ہے۔ اسے النساء کہا جاتا ہے کیونکہ اس خط میں عورتوں سے متعلق بہت سی باتوں کا ذکر کیا گیا ہے اور دوسرے خطوط کے مقابلے میں اس خط میں سب سے زیادہ بات کی گئی ہے۔ ایک اور خط جو خواتین کے بارے میں بھی بات کرتا ہے وہ ہے اطلاق کا خط۔ اس سلسلے میں عام طور پر ان النساء خط کو کہا جاتا ہے: النساء الکبریٰ خط (بڑا عن النساء خط)، جبکہ اطلاق خط کو کہا جاتا ہے: النساء اششغرا (چھوٹا اننساء خط) )۔

5. سورہ المائدة (سورۃ المائدۃ (دسترخوان کے برتن))، 120 آیات | مدينة
سورہ مائدہ 120 آیات پر مشتمل ہے۔ مدنی سورہ گروپ سمیت۔ اگرچہ مکہ میں نازل ہونے والی ایک آیت ہے، لیکن یہ آیت رسول اللہ صلی اللہ علیہ وسلم کے بعد نازل ہوئی۔ مدینہ کی طرف ہجرت کی، یعنی حج وداع کے وقت۔ اس خط کو المائدہ (پکوان) کہا جاتا ہے کیونکہ اس میں حضرت عیسیٰ علیہ السلام کے وفادار پیروکاروں کی کہانی ہے۔ حضرت عیسیٰ علیہ السلام سے پوچھا۔ تاکہ اللہ ان کے لیے آسمان سے المائدۃ (کھانے کے پکوان) اتارے (آیت 112)۔ اور اسے عقد (عہد) کہا جاتا ہے، کیونکہ یہ لفظ اس خط کی پہلی آیت میں موجود ہے، جہاں اللہ تعالیٰ اپنے بندوں کو حکم دیتا ہے کہ وہ اللہ کے ساتھ وفاداری کا وعدہ اور ایک دوسرے کے ساتھ کیے گئے معاہدوں کو پورا کریں۔ اسے المنقدز (بچانے والا) بھی کہا جاتا ہے، کیونکہ اس خط کے آخر میں حضرت عیسیٰ علیہ السلام کا قصہ ہے۔ اپنے وفادار پیروکاروں کو اللہ کے عذاب سے بچانے والا۔

6. سورۃ الأنعام (سورۃ الانعام)، 165 آیات | مكة
سورہ انعام (مویشیوں کے جانور: اونٹ، گائے، بھیڑ اور بکری) جو 165 آیات پر مشتمل ہے، مکی سورہ گروپ میں شامل ہے، کیونکہ اس کی تقریباً تمام آیات ہجرت سے پہلے مکہ میں نازل ہوئی تھیں۔ اسے الانعام اس لیے کہا جاتا ہے کہ اس میں لفظ انعام کا ذکر مشرکین کے رسم و رواج کے حوالے سے کیا گیا ہے جن کے مطابق مویشیوں کو اپنے معبود کا قرب حاصل کرنے کے لیے استعمال کیا جا سکتا ہے۔ اس خط میں مویشیوں سے متعلق قوانین کا بھی ذکر ہے۔

7. سورۃ الأعراف (سورۃ الاعراف) 206 آیات | مكة
سورہ الاعراف جس کی 206 آیات ہیں، مکیہ سورہ گروپ میں شامل ہے، جو الانعام سورہ کے نزول سے پہلے نازل ہوئی تھی اور اصحاب الثالث سورہ گروپ (سات لمبی سورتوں) میں شامل ہے۔ اسے الاعراف اس لیے کہا جاتا ہے کہ لفظ اعراف آیت نمبر 46 میں موجود ہیں جو کہ ان لوگوں کی حالت کی وضاحت کرتی ہے جو اعراف سے اوپر ہیں، یعنی: جنت اور جہنم کی سرحد پر بلند ترین مقام۔

8. سورت الأنفال (سورۃ الانفال (جنگ کے غنیمت)، 75 آیات | مدينة
سورہ الانفال 75 آیات پر مشتمل ہے اور اسے مدنی سورہ گروپ میں شامل کیا گیا ہے کیونکہ اس کی تمام آیات مدینہ میں نازل ہوئیں۔ اس خط کو الانفال کہا جاتا ہے جس کا مطلب ہے جنگ کا سامان کیونکہ اس خط کے شروع میں لفظ الانفال آیا ہے اور اس خط میں جو مسائل بھی نمایاں ہیں وہ غنیمتوں کے بارے میں ہیں، جنگ کے قوانین اور جنگ سے متعلق امور۔ جنرل ابن عباس رضی اللہ عنہ کی تاریخ کے مطابق یہ خط جنگ بدر کبریٰ کے سلسلے میں نازل ہوا تھا جو ہجری کے دوسرے سال ہوئی تھی۔ یہ جنگ بہت اہم ہے، کیونکہ اسی نے اسلامی ترقی کے تاریخی راستے کا تعین کیا تھا۔ اس وقت مسلمانوں نے ایک قلیل فوج کے ساتھ پہلی بار مشرکین کو شکست دی جو کہ تعداد میں بہت زیادہ تھے اور اس جنگ میں انہیں بہت زیادہ مال غنیمت حاصل ہوا۔ چنانچہ مسئلہ یہ پیدا ہوا کہ غنیمت کی تقسیم کیسے کی جائے تو اللہ تعالیٰ نے اس خط کی پہلی آیت نازل فرمائی۔

9. سورہ التوبة (سورہ توبہ) 129 آیات | مدينة
سورہ توبہ 129 آیات پر مشتمل ہے جن میں مدنی سورتیں بھی شامل ہیں۔ اس خط کو التتوبہ کہا جاتا ہے جس کا مطلب ہے بخشش اس لیے کہ اس خط میں لفظ توبہ کا بار بار ذکر آیا ہے۔ اسے برعہ بھی کہا جاتا ہے جس کے معنی ترک کرنا ہیں، جس کا مطلب یہاں تعلقات منقطع کرنے کا بیان ہے، کیونکہ بحث کے زیادہ تر نکات مشرکین کے ساتھ صلح کے معاہدے کو ختم کرنے کے بیانات سے متعلق ہیں۔  ان دو مشہور ناموں کے علاوہ اور بھی کئی نام ہیں جو اس حرف کی نوعیت ہیں۔  دوسرے حروف کے مقابلے میں اس خط کے شروع میں بسم اللہ نہیں ہے کیونکہ یہ خط اعلان جنگ ہے یعنی تمام مسلمان تمام مشرکوں سے لڑنے کے لیے متحرک ہیں، جب کہ بسم اللہ امن اور اللہ کی محبت کا سانس لیتی ہے۔  یہ خط رسول اللہ صلی اللہ علیہ وسلم کے بعد نازل ہوا۔ جنگ تبوک سے واپس آئے جو 9 ہجری میں پیش آئی۔ یہ اعلان سیدنا علی رضی اللہ عنہ نے کیا۔ اسی سال حج کے موسم میں۔

10. سورہ یونس (سورہ یونس)، 109 آیات | مكة
سورہ یونس 109 آیات پر مشتمل ہے، جن میں مکی حروف بھی شامل ہیں، سوائے آیات 40، 94، 95 کے، جو رسول اللہ صلی اللہ علیہ وسلم کے دور میں نازل ہوئیں۔ مدینہ میں تھا۔ اس خط کو یونس کا خط کہا جاتا ہے کیونکہ یہ خط بنیادی طور پر حضرت یونس علیہ السلام کی کہانی کو ظاہر کرتا ہے۔ اور اس کے پیروکار جو اپنے ایمان پر پختہ ہیں۔

11. سورہ هود (سورہ هود)، 123 آیات | مكة
سورہ ہود مکی سورہ گروپ میں شامل ہے جو سورہ یونس کے بعد 123 آیات پر مشتمل ہے۔ اس خط کو ہود خط کہا جاتا ہے کیونکہ اس کا تعلق حضرت ہود علیہ السلام سے ہے۔ اور اس خط میں دیگر انبیاء کے قصے بھی ہیں، جیسے نوح علیہ السلام، صالح علیہ السلام، ابراہیم علیہ السلام، لوط علیہ السلام، شعیب علیہ السلام کے قصے بھی۔ اور موسیٰ علیہ السلام

12. سورہ یوسف (سورہ یوسف)، 111 آیات | مكة
سورہ یوسف 111 آیات پر مشتمل ہے جن میں مکی سورتیں بھی شامل ہیں کیونکہ یہ ہجرت سے پہلے مکہ میں نازل ہوئی تھی۔ اس خط کو یوسف کا خط کہا جاتا ہے کیونکہ اس کے مواد کا زیادہ زور حضرت یوسف علیہ السلام کی تاریخ پر ہے۔  یہ تاریخ ان مافوق الفطرت کہانیوں میں سے ایک ہے جو رسول اللہ صلی اللہ علیہ وسلم پر نازل ہوئیں۔ اس کے لیے ایک معجزہ کے طور پر، جب کہ اس خط کے نازل ہونے سے پہلے وہ اس کے بارے میں نہیں جانتے تھے۔  تاریخ البیحقی کی کتاب عاد دلائل میں ہے کہ یہودیوں کے ایک گروہ نے یوسف علیہ السلام کا قصہ سن کر اسلام قبول کیا۔ اس کی وجہ یہ ہے کہ یہ ان کہانیوں سے میل کھاتا ہے جو وہ جانتے ہیں۔ یوسف علیہ السلام کے قصے سے یہ، حضرت محمد صلی اللہ علیہ وسلم بہت سے اسباق حاصل کیے اور اپنے فرائض کی انجام دہی میں اس کے لیے ایک سکون تھا۔

13. سورہ الرعد (سورہ الرعد (گروہ گرج))، 43 آیات | مدينة
سورہ رعد مدنی سورتوں سمیت 43 آیات پر مشتمل ہے۔ اس سورت کو الرعد کہا جاتا ہے جس کا مطلب گرج ہے کیونکہ آیت 13 میں اللہ تعالیٰ فرماتا ہے جس کا مطلب ہے اور گرج اس کی حمد کرتے ہوئے تسبیح کرتی ہے، اللہ سبحانہ و تعالیٰ کی پاکیزگی اور کمال کی نوعیت کو ظاہر کرتی ہے۔  اور پھر قرآن کی فطرت کے مطابق جس میں دھمکیاں اور امیدیں ہیں، گرج کی آواز بھی انسانوں میں اضطراب اور امید کو جنم دیتی ہے۔ اس خط کا سب سے اہم مواد یہ ہے کہ خدا کی اپنی مخلوق کے لیے ہدایت کا تعلق سبب اور اثر کے قانون سے ہے۔ اللہ تعالیٰ کے لیے سزا کے تعین میں کوئی جانبداری نہیں ہے۔ بدلہ یا سزا خدا کے قانون کی اطاعت یا نافرمانی کا نتیجہ ہے۔

14. سورہ ابراہیم (سورہ ابراہیم (ابراہیم ابراہیم))، 52 آیات | مكة
ابراہیم کا یہ خط 52 آیات پر مشتمل ہے جس میں مکی خطوط بھی شامل ہیں کیونکہ یہ ہجرت سے پہلے مکہ میں نازل ہوا تھا۔ اسے ابراہیم کہا جاتا ہے کیونکہ اس خط میں حضرت ابراہیم علیہ السلام کی دعا ہے۔ یعنی آیات 35 تا 41۔ اس دعا میں دیگر چیزوں کے علاوہ: اس کی اولاد سے دعا کرنے کی درخواست، بتوں کی پوجا سے دور رہنے اور مکہ اور اس کے آس پاس کے علاقے کو ایک محفوظ اور خوشحال علاقہ بنانے کی درخواست ہے۔ حضرت ابراہیم علیہ السلام کی دعا اللہ تعالیٰ نے اس کی اجازت دی ہے۔ جیسا کہ ماضی سے اب تک محفوظ ثابت ہوا ہے۔ اس نے یہ دعا اللہ عزوجل کی بارگاہ میں کہی۔ مکہ کے بنجر میدانوں میں اپنے بیٹے اسماعیل ع کے ساتھ خانہ کعبہ کی تعمیر مکمل کرنے کے بعد۔

15. سورہ الحجر (سورہ الحجر (حجر دی راک))، 99 آیات | مكة
یہ سورت مکی سورتوں سمیت 99 آیات پر مشتمل ہے کیونکہ یہ ہجرت سے پہلے مکہ میں نازل ہوئی تھی۔ الحجر ایک پہاڑی علاقے کا نام ہے جو قدیم ثمود کے ذریعہ آباد تھا جو مدینہ اور شام (شام) کے درمیان سڑک کے کنارے واقع ہے۔ اس خط کا نام پہاڑی علاقے کے نام سے لیا گیا ہے کیونکہ اس کے باشندوں یعنی ثمود کا انجام آیات 80 تا 84 میں بتایا گیا ہے کہ انہیں اللہ تعالیٰ نے ہلاک کر دیا کیونکہ انہوں نے حضرت صالح علیہ السلام سے جھوٹ بولا تھا۔  اور اللہ کی آیات سے منہ پھیر لو۔ اس خط میں دوسرے لوگوں کے قصے بھی ہیں جنہیں اللہ نے ہلاک کر دیا ہے، جیسے لوط علیہ السلام کی قوم۔ اور شعیب علیہ السلام ان تمام کہانیوں سے ایک سبق سیکھا جا سکتا ہے کہ جو لوگ رسولوں کی تعلیمات کی مخالفت کرتے ہیں وہ تباہی کا شکار ہوں گے۔

16. سورہ النحل (سورہ النحل) 128 آیات | مكة
یہ خط مکی حروف سمیت 128 آیات پر مشتمل ہے۔ اس حرف کو عن نحل کہتے ہیں جس کے معنی شہد کی مکھی کے ہیں کیونکہ اس میں اللہ تعالیٰ کے کلمات ہیں۔ آیت 68 جس کا مطلب ہے: "اور آپ کے رب نے اسے شہد کی مکھیوں پر نازل کیا۔" شہد کی مکھیاں خدا کی مخلوق ہیں جو انسانوں کو بہت سے فوائد اور لذتیں فراہم کرتی ہیں۔ شہد کی مکھیوں کے ذریعہ تیار کردہ شہد اور قرآن الکریم میں مماثلت پائی جاتی ہے۔ شہد مختلف پھولوں کے جوہروں سے آتا ہے اور مختلف انسانی بیماریوں کی دوا ہے (دیکھیں آیت 69)۔ دریں اثنا، قرآن ان کتابوں کا نچوڑ پر مشتمل ہے جو قدیم انبیاء پر نازل ہوئی تھیں اور اس کے ساتھ ساتھ دنیا اور آخرت میں سعادت حاصل کرنے کے لیے ہر وقت کی تمام قوموں کو درکار تعلیمات بھی شامل ہیں۔ (دیکھئے خط (10) یونس آیت 57 اور خط (17) الاسراء آیت 82)۔ اس خط کو "نعم" یعنی نعمتیں بھی کہتے ہیں، کیونکہ اس میں اللہ تعالیٰ نے اپنے بندوں کے لیے طرح طرح کی نعمتوں کا ذکر کیا ہے۔

17. سورہ الإسراء (سورہ الاسراء (رات کا سفر رات کا سفر))، 111 آیات | مكة
یہ خط مکی حروف سمیت 111 آیات پر مشتمل ہے۔ اسے الاسراء کہا جاتا ہے جس کا مطلب ہے رات کو سفر کرنا، کیونکہ اسراء واقعہ نبی اکرم صلی اللہ علیہ وسلم کا ہے۔ مکہ کی عظیم الشان مسجد سے بیت المقدس میں مسجد اقصیٰ تک اس خط کی پہلی آیت میں بیان کیا گیا ہے۔ اس خط کے شروع میں اسراء کا قصہ بیان کرنے سے یہ اشارہ ملتا ہے کہ حضرت محمد صلی اللہ علیہ وسلم اور اس کے لوگ بعد میں اعلیٰ مقام پر فائز ہوں گے اور عظیم لوگ بنیں گے۔ اس خط کو بنی اسرائیل بھی کہا جاتا ہے، یعنی بنی اسرائیل، اس خط کے آغاز کے سلسلے میں، یعنی دوسری آیت سے آٹھویں آیت تک اور پھر حرف کے آخر تک، یعنی آیت نمبر 101 سے آیت 104 تک اللہ تعالیٰ نے فرمایا۔ بنی اسرائیل کا تذکرہ ہے جو ایک مضبوط قوم بننے کے بعد پھر پروان چڑھے اور پھر ذلیل قوم بن گئے کیونکہ اس نے اللہ تعالیٰ کی تعلیمات سے انحراف کیا۔ اس خط میں قصہ اسراء اور بنی اسرائیل کی تاریخ کے درمیان تعلق اس بات کی تنبیہ کرتا ہے کہ اگر وہ بھی اپنی مذہبی تعلیمات کو چھوڑ دیں تو بنی اسرائیل کی طرح امت مسلمہ کو بھی تباہی کا سامنا کرنا پڑے گا۔

18. سورۃ الكهف (سورۃ الکہف (گوا غار))، 110 آیات | مكة
یہ خط مکی حروف سمیت 110 آیات پر مشتمل ہے۔ اس کا نام الکہفی ہے جس کا مطلب ہے غار اور اشہاب الکہفی یعنی غار میں رہنے والے۔ یہ دونوں نام اس خط میں آیت نمبر 9 سے 26 میں درج کہانی سے لیے گئے ہیں، جو کئی نوجوانوں کے بارے میں ہیں جو ایک غار میں برسوں سے سوتے تھے۔ اس قصے کے علاوہ اس خط میں کئی کہانیاں بھی ہیں جن میں سے تمام احادیث اور اسباق ہیں جو انسانی زندگی کے لیے بہت مفید ہیں۔ نبی کریم صلی اللہ علیہ وسلم کی بہت سی احادیث جو اس خط کو پڑھنے کی اہمیت بیان کرتا ہے۔

19. سورہ مریم (سورہ مریم)، ​​98 آیات | مكة
سورہ مریم 98 آیات پر مشتمل ہے، جن میں مکی سورتیں بھی شامل ہیں، کیونکہ تقریباً تمام آیات نبی کریم صلی اللہ علیہ وسلم کے دیدار سے پہلے نازل ہوئی تھیں۔ مدینہ کی طرف ہجرت کی، یہاں تک کہ اس کے دوستوں نے حبشی ملک کی طرف ہجرت کی۔ ابن مسعود کی تاریخ کے مطابق جعفر بن ابی طالب نے شاہ نجاسی اور ان کے پیروکاروں کے نام مریم کے خط کی ابتداء پڑھی جب وہ اپنے دوسرے دوستوں کے ساتھ حبشی ملک کی طرف ہجرت کر گئے اس خط کا نام مریم رکھا گیا۔ حضرت عیسیٰ علیہ السلام کی والدہ مریم کا قصہ۔ جو مکمل طور پر معجزانہ تھا، یعنی اپنے بیٹے عیسیٰ علیہ السلام کو جنم دینا، حالانکہ اس نے پہلے کبھی کسی مرد سے شادی نہیں کی تھی اور نہ ہی اس کے ساتھ جنسی تعلقات قائم کیے تھے۔ حضرت عیسیٰ علیہ السلام کی ولادت بغیر باپ کے اللہ تعالیٰ کی قدرت کی دلیل ہے۔  اس خط میں مریم کی کہانی کو ایک غیر معمولی اور معجزاتی واقعہ بتانے کا آغاز ایک غیر معمولی اور معجزاتی واقعہ کی کہانی سے ہوتا ہے، یعنی زکریا علیہ السلام کی دعا کی منظوری۔ اللہ سبحانہ وتعالیٰ کی طرف سے، تاکہ اسے ایک بیٹا عطا کیا جائے اور اس کے نظریات اور عقائد کا تسلسل برقرار رہے، حالانکہ وہ بہت بوڑھا تھا اور اس کی بیوی بانجھ تھی، جو حیاتیاتی سائنس کے معیارات کے مطابق ناممکن تھی۔

20. سورہ طه (سورہ طٰہٰ، 135 آیات) مكة
سورہ طٰہٰ 135 آیات پر مشتمل ہے، جو سورہ مریم کے نزول کے بعد نازل ہوئی، بشمول مکی حروف کا گروپ۔ اس خط کا نام طہٰ ہے جو اس حرف کی پہلی آیت سے نکلنے والے الفاظ سے لیا گیا ہے۔ جیسا کہ ان حروف میں عام ہے جن میں شروع میں حروف تہجی کے حروف کا استعمال کیا جاتا ہے، جہاں یہ خط پڑھنے والوں کے لیے خدا کی اطلاع معلوم ہوتا ہے، کہ حرف کے بعد ایسی چیزیں بیان کی جائیں گی جن کا جاننا بہت ضروری ہے، لہٰذا یہ ہے۔ اس خط میں حروف تہذہ کے بعد آنے والی آیات کا بھی معاملہ ہے۔ اللہ وضاحت کرتا ہے کہ قرآن انسانوں کے لیے ایک تنبیہ ہے، کائنات کے خالق اللہ کی طرف سے وحی ہے۔ پھر اللہ نے کئی انبیاء کا قصہ بیان کیا۔ موجودہ نتائج ان لوگوں کو بھگتنا ہوں گے جو اللہ پر ایمان رکھتے ہیں اور جو لوگ اس کا انکار کرتے ہیں، دنیا اور آخرت دونوں میں۔ مذکورہ بالا امور کے علاوہ اس خط میں درج ذیل اہم مواد ہیں:

21. سورہ الأنبیاء (سورہ الانبیاء)، 112 آیات | مكة
سورہ الانبیاء، جو 112 آیات پر مشتمل ہے، مکی سورہ گروپ میں شامل ہے۔ اس خط کو الانبیاء (انبیاء) کہا جاتا ہے، کیونکہ یہ خط متعدد انبیاء کے قصے بیان کرتا ہے۔ خط الانبیاء کا آغاز اس بات پر زور دیتا ہے کہ انسان یوم حساب کا سامنا کرنے سے غافل ہیں، پھر مشرکین مکہ کے پیغمبر محمد صلی اللہ علیہ وسلم کی وحی کے انکار کی وجہ سے۔ چنانچہ اللہ نے اس بات پر زور دیا کہ اگرچہ انبیاء عام انسان تھے، وہ ہر ایک انسان تھے جو وحی لائے جن کی بنیادی تعلیمات توحید تھیں، اور انسانوں پر اللہ، خالق کی عبادت کرنا فرض تھا۔ جو لوگ اللہ کی قدرت کو تسلیم نہیں کرنا چاہتے اور انبیاء کی لائی ہوئی تعلیمات کا انکار کرنا چاہتے ہیں اللہ کی طرف سے دنیا اور آخرت میں عذاب ہوگا۔ پھر کئی انبیاء اور ان کی امت کا قصہ پیش کیا گیا۔ آخر میں یہ خط مشرکین مکہ سے اس اپیل کے ساتھ بند ہوا کہ وہ محمد صلی اللہ علیہ وسلم کی لائی ہوئی تعلیمات پر ایمان لائیں تاکہ وہ وہ تجربہ نہ کر سکیں جو پہلے لوگوں نے کیا تھا۔

22. سورۃ الحج (سورۃ الحج)، 78 آیات | مدينة
مدنی سورہ گروپ میں شامل سورہ الحج 78 آیات پر مشتمل ہے جب کہ بعض مفسرین کے خیال میں یہ سورہ مکی گروپ میں شامل ہے۔ اس اختلاف کی وجہ یہ ہے کہ اس خط کی کچھ آیات مکہ میں نازل ہوئیں اور کچھ مدینہ میں نازل ہوئیں۔ اس خط کو الحج کہا جاتا ہے کیونکہ اس خط میں حج سے متعلق امور مثلاً احرام، طواف، سعی، عرفہ کا وقوف، بال منڈوانا، اللہ کا سیر، وظائف اور حکمتیں بیان کی گئی ہیں۔ حج کی حکمتیں بیان کی گئی ہیں۔ اس بات پر بھی زور دیا گیا کہ حج حضرت ابراہیم علیہ السلام کے دور میں فرض کیا گیا تھا، اور کعبہ کی بنیاد حضرت ابراہیم علیہ السلام نے رکھی تھی۔ ان کے بیٹے اسماعیل علیہ السلام کے ساتھ الغزنوی کے مطابق، حج کا خط ان معجزاتی خطوط میں سے ہے جو رات اور دن میں نازل ہوتے ہیں، مسافروں اور غیر مسافروں میں ایسی آیات ہیں جو مکہ میں نازل ہوئیں اور کچھ مدینہ میں نازل ہوئیں، اس کے کچھ مضامین جنگ سے متعلق ہیں اور کچھ امن سے متعلق ہیں، کچھ آیات محکم ہیں اور کچھ متشابہات ہیں۔

23. سورہ المؤمنون (سورہ المؤمنون)، 118 آیات | مكة
سورۃ المومنون 118 آیات پر مشتمل ہے جن میں مکی سورتیں بھی شامل ہیں۔ اس کا نام المومنون رکھا گیا ہے، کیونکہ اس آیت کی ابتداء بتاتی ہے کہ مومنین کی وہ خصوصیات کیا ہونی چاہئیں جو آخرت میں ان کی قسمت اور دنیا میں ان کی روحوں کے سکون کا باعث بنیں۔ یہ صفات اس قدر بلند ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے اخلاق بن گئے ہیں۔

24. سورہ النور (سورۃ النور)، 64 آیات | مدينة
سورہ النور 64 آیات پر مشتمل ہے اور مدنی سورہ گروپ میں شامل ہے۔ اس کا نام النور رکھا گیا ہے جس کا مطلب نور ہے، لفظ النور سے لیا گیا ہے جو آیت نمبر 35 میں موجود ہے۔ نور الہی کے بارے میں وضاحت کرتا ہے، یعنی القرآن جس میں ہدایات موجود ہیں۔ خدا کی ہدایات ایک روشن روشنی ہیں جو کائنات کو منور کرتی ہے۔ اس خط میں زیادہ تر سماجی اور گھریلو معاملات سے متعلق خدا کی ہدایات پر مشتمل ہے۔

25. سورہ الفرقان (سورہ الفرقان)، 77 آیات | مكة
یہ خط مکی حروف سمیت 77 آیات پر مشتمل ہے۔ اس کا نام الفرقان رکھا گیا ہے جس کا مطلب ہے فرق کرنے والا، لفظ الفرقان سے لیا گیا ہے جو اس حرف کی پہلی آیت میں موجود ہے۔ اس آیت میں الفرقان سے جو مراد ہے وہ القرآن ہے۔ قرآن کو الفرقان کہا جاتا ہے کیونکہ یہ حق اور باطل میں فرق کرتا ہے۔ چنانچہ اس خط میں ایسی آیات ہیں جو اللہ سبحانہ وتعالیٰ کی وحدانیت کی حقیقت میں فرق کرتی ہیں۔ شرک عقائد کے جھوٹ کے ساتھ.

26. سورہ الشعراء، 227 آیات | مكة
یہ خط مکی حروف سمیت 227 آیات پر مشتمل ہے۔ اس کو اسّی سَیْرَاء کہا جاتا ہے (آسِی سَیْرَ کی جمع جس کا مطلب شاعر ہے) لفظ عاصی سُوراء سے لیا گیا ہے جو کہ آیت 224 میں پایا جاتا ہے، یعنی اس خط کے آخری حصے میں، جب اللہ سبحانہ وتعالیٰ نے فرمایا۔ خاص طور پر شاعروں کے مقام کا ذکر کیا ہے۔ شاعروں میں رسولوں سے بہت مختلف خصوصیات تھیں۔ ان کے پیچھے ایسے لوگ آتے ہیں جو گمراہ ہیں اور وہ اپنی زبان کو مروڑنا پسند کرتے ہیں اور ان کا کوئی یقین نہیں ہے، ان کے اعمال ان کے یقین کی کمی کے مطابق نہیں ہیں، ان کے اعمال ان کے کہنے کے مطابق نہیں ہیں۔ ایسی خوبیاں رسولوں میں کبھی نہیں پائی گئیں۔ لہٰذا یہ نبی کریم صلی اللہ علیہ وسلم کے لیے مناسب نہیں۔ شاعر ہونے کا الزام، اور قرآن پر شاعری کا الزام، قرآن اللہ کی طرف سے نازل کردہ وحی ہے، انسان کی تخلیق نہیں ہے۔

27. سورہ النمل (سورہ نمل)، 93 آیات | مكة
سورہ نمل 98 آیات پر مشتمل ہے، یہ مکی حروف کے گروہ سے تعلق رکھتی ہے اور سورہ عاص کے بعد نازل ہوئی ہے۔ اسے عن نمل کا نام دیا گیا ہے، کیونکہ آیات 18 اور 19 میں عن نمل (چیونٹی) کے الفاظ ہیں، جہاں چیونٹیوں کا بادشاہ اپنے ماتحتوں سے کہتا ہے کہ وہ اپنے اپنے گھونسلوں میں داخل ہو جائیں، تاکہ وہ حضرت سلیمان علیہ السلام کے قدموں پر نہ پڑیں۔ اور اس کے سپاہی جو اس جگہ سے گزریں گے۔ چیونٹی کے بادشاہ کا حکم اپنے ماتحتوں کو سن کر حضرت سلیمان علیہ السلام مسکرائے اور چیونٹی کی بادشاہت کے نظم و ضبط پر حیران رہ گئے اور اللہ تعالیٰ کا شکر ادا کیا جس نے ان کو بادشاہی، دولت، فہم و فراست، جانوروں کی بول چال کی صورت میں نعمتوں سے نوازا تھا۔ اور جنوں، انسانوں، پرندوں وغیرہ پر مشتمل ایک مضبوط لشکر۔ حضرت سلیمان علیہ السلام جن لوگوں کو اللہ تعالیٰ نے عظیم نعمتیں عطا کی ہیں وہ تکبر یا تکبر نہیں کرتے اور اللہ کا بندہ ہونے کے ناطے اللہ سے دعا کرتے ہیں کہ وہ انہیں نیک لوگوں میں شامل کرے۔ اللہ SWT. اس خط میں چیونٹیوں کا ذکر ہے تاکہ انسان ان چیونٹیوں کی زندگی سے سبق حاصل کر سکے۔ چیونٹیاں وہ جانور ہیں جو زمین میں گروہوں میں رہتے ہیں، سردیوں کے کھانے کو ذخیرہ کرنے کے لیے بل اور کثیر المنزلہ جگہوں کو مکان اور گودام بناتے ہیں۔ چیونٹیوں کی بادشاہی میں جو صفائی اور نظم و ضبط موجود ہے، اللہ تعالیٰ اس آیت میں بتاتا ہے کہ کس طرح چیونٹیوں نے اپنے بادشاہ کی طرف سے تنبیہ ملنے کے بعد فوری طور پر حفاظت کی کوشش کی تاکہ حضرت سلیمان علیہ السلام اور ان کے سپاہیوں کی طرف سے قدم نہ رکھا جائے۔ بالواسطہ طور پر، اللہ تعالیٰ نے انسانوں کو یہ بھی یاد دلایا کہ اپنی روزمرہ کی ضروریات کو پورا کرنے کی کوشش میں، عام بھلائی وغیرہ کو ترجیح دیتے ہوئے، چیونٹی والے بھی اچھی تنظیم اور تعاون رکھتے ہیں۔ حضرت سلیمان علیہ السلام کا واقعہ بیان کرتے ہوئے اس خط میں اللہ تعالیٰ نے نبی کریم صلی اللہ علیہ وسلم کے مستقبل اور عظمت کی طرف اشارہ کیا ہے۔ حضرت سلیمان علیہ السلام جیسا کہ ایک نبی، رسول اور بادشاہ جس کو بے شمار دولت سے نوازا گیا تھا، اسی طرح حضرت محمد صلی اللہ علیہ وسلم بھی تھے۔ ایک نبی، رسول اور سربراہ مملکت کی حیثیت سے امت اور غریب اپنی قوم کو اللہ کے راستے پر لانے اور لے جانے میں کامیاب ہوں گے۔

28. سورۃ القصص (سورۃ القصص)، 88 آیات | مكة
سورۃ القشش 88 آیات پر مشتمل ہے جن میں مکی سورتیں بھی شامل ہیں۔ اس کا نام القشش رکھا گیا ہے کیونکہ اس خط کی آیت نمبر 25 میں لفظ القشاش ہے جس کے معنی کہانی ہیں۔ یہ آیت بتاتی ہے کہ حضرت موسیٰ علیہ السلام کے بعد۔ حضرت شعیب علیہ السلام سے ملاقات ہوئی۔ اس نے اپنی ذات سے متعلق کہانیاں بیان کیں، یعنی فرعون کے ساتھ اپنے تجربات، جب تک کہ اسے فرعون نے قبطی قوم کے ایک شخص شعیب علیہ السلام کو حادثاتی طور پر قتل کرنے کے لیے شکار کیا تھا۔ جواب دیا کہ موسیٰ علیہ السلام ظالم لوگوں کے ظلم و ستم سے بچ گیا ہے۔ اس خط کی آیت نمبر 25 کا نزول نبی اکرم صلی اللہ علیہ وسلم کے لیے بہت بڑا معنی رکھتا ہے۔ اور مدینہ کی طرف ہجرت کرنے والے دوستوں کے لیے، جس سے ان کے اعتماد میں اضافہ ہوتا ہے کہ آخر کار مسلمانوں کی ہی فتح ہوگی، کیونکہ یہ آیت بتاتی ہے کہ جو کوئی دشمن کی جگہ سے اپنے عقیدے کے دفاع کے لیے ہجرت کرے گا، وہ یقیناً اپنے دشمنوں کے خلاف جدوجہد میں کامیاب ہوگا۔ مذہب اس خط کے آخر میں مسلمانوں کی فتح کے یقینی ہونے پر زور دیا گیا ہے جس میں کہا گیا ہے کہ مدینہ منورہ منتقل ہونے کے بعد مسلمان فاتح اور اللہ کے دین کے علمبردار بن کر مکہ واپس آئیں گے۔ سورہ القشاش سب سے مکمل خط ہے جس میں حضرت موسیٰ علیہ السلام کی کہانی ہے۔ چنانچہ ایک تاریخ کے مطابق اس خط کو موسیٰ کا خط بھی کہا جاتا ہے۔

29. سورہ العنکبوت (سورہ العنکبوت (مکڑی))، 69 آیات | مكة
سورہ عنکبوت مکی حروف سمیت 69 آیات پر مشتمل ہے۔ اس خط کی آیت نمبر 41 میں لفظ العنکبوت کی وجہ سے اس کا نام العنکبوت رکھا گیا ہے جس کا مطلب مکڑی ہے، جہاں اللہ تعالیٰ نے بتوں کی پرستش کرنے والوں کو ایک مکڑی سے تشبیہ دی ہے جو اپنے گھر کی طاقت پر یقین رکھتی ہے کہ وہ اس کے لیے پناہ لینے کی جگہ ہے۔ ایک ایسی جگہ جہاں وہ اپنے شکار کو پھنساتا ہے، اگرچہ ہوا چلتی ہے یا اس پر کوئی چھوٹی چیز گر جاتی ہے، گھر تباہ ہو جائے گا۔ اسی طرح مشرکین اپنی عبادت کی طاقت کو ایک پناہ گاہ اور جو چاہیں مانگنے کی جگہ مانتے ہیں، حالانکہ ان کی عبادت دنیا میں اللہ کے عذاب سے ان کی ذرا بھی مدد نہیں کر سکتی، جیسا کہ ہوا۔ قوم نوح، قوم ابراہیم، قوم لوط، قوم شعیب، قوم صالح اور دیگر۔ مزید برآں، آخرت میں اللہ کے عذاب کا سامنا کرتے ہوئے، ان کے معبود ان کو روکنے اور حفاظت کرنے سے بھی زیادہ عاجز ہیں۔

30. سورہ الروم (سورہ روم (رومن دی رومز))، 60 آیات | مكة
سورہ روم 60 آیات پر مشتمل ہے، جس میں مکیہ حروف کا گروپ بھی شامل ہے جو آیت النسائق کے بعد نازل ہوا ہے۔ اسے اروم کہا جاتا ہے کیونکہ اس خط کے شروع میں یعنی آیات 2، 3 اور 4 میں رومیوں کے بارے میں خبر ہے جنہیں شروع میں فارسیوں نے شکست دی تھی، لیکن کئی سالوں کے بعد روم سلطنت اس قابل ہو گئی کہ وہ بدلہ لے اور اسے شکست دے سکے۔ فارس کی بادشاہت دوبارہ۔ یہ قرآن کا ایک معجزہ ہے، یعنی مستقبل میں ہونے والی چیزوں کی اطلاع دینا۔ اور یہ بھی ایک نشانی ہے کہ جو مسلمان اس وقت بہت کمزور تھے وہ جیت جائیں گے اور مشرکوں کو نیست و نابود کر سکیں گے۔ یہ اشارہ پہلی بار جنگ بدر میں ثابت ہوا۔

31. سورہ لقمان (سورہ لقمان)، 34 آیات | مكة
لقمان کا خط 34 آیات پر مشتمل ہے، جن میں مکی حروف بھی شامل ہیں، جو خط شفاعت کے بعد نازل ہوئے۔ اس کا نام لقمان رکھا گیا ہے کیونکہ آیت نمبر 12 میں بتایا گیا ہے کہ لقمان کو اللہ نے نعمتیں اور علم عطا کیا ہے اس لیے وہ عطا کردہ نعمتوں پر اس کا شکر گزار ہے۔   اور آیت 13 سے 19 میں لقمان کی اپنے بچوں کو نصیحت ہے کہ یہ اللہ کی طرف سے ایک نشانی ہے کہ ہر ماں اور باپ کو بھی اپنے بچوں کے ساتھ وہی کرنا چاہیے جو لقمان نے کیا ہے۔

32. سورہ السجدة (سورہ سجدہ)، 30 آیات | مكة
سورہ سجدہ 30 آیات پر مشتمل ہے جس میں مکی سورہ بھی شامل ہے جو سورہ المومنون کے بعد نازل ہوئی ہے۔ اس کو سجدہ اس لیے کہا جاتا ہے کہ اس حرف میں ایک سجدہ آیت ہے یعنی پندرہویں آیت۔

33. سورہ الأحزاب (سورہ الاحزاب (قبیلہ کے گروہ))، 73 آیات | مدينة
سورہ احزاب 73 آیات پر مشتمل ہے جن میں مدنی سورتیں بھی شامل ہیں جو سورہ علی عمران کے بعد نازل ہوئی ہیں۔ اس کا نام الاحزاب رکھا گیا ہے جس کا مطلب اتحادی گروہ ہے کیونکہ اس خط میں متعدد آیات ہیں، یعنی آیات 9 سے آیت 27 جو جنگ الاحزاب سے متعلق ہیں، یعنی مدینہ میں اہل ایمان کے خلاف یہودیوں، منافقین اور مشرکین کی جنگ۔ . انہوں نے مومنوں کو اتنا گھیر لیا تھا کہ ان میں سے بعض نے امید چھوڑ دی تھی اور یہ خیال کیا تھا کہ وہ ان کے دشمنوں کے ہاتھوں تباہ ہو جائیں گے۔ یہ اللہ کی طرف سے ایک سخت امتحان ہے کہ ان کا ایمان کتنا پختہ ہے۔ آخر کار اللہ تعالیٰ نے ایک نادیدہ فوج اور سمندری طوفان کی صورت میں مدد بھیجی کہ دشمن آپس میں الجھ کر بھاگ گئے۔

34. سورہ سبإ (سورہ سبا' (سبا' شیبہ)، 54 آیات | مكة
سورہ سبا 54 آیات پر مشتمل ہے جن میں مکی سورتیں بھی شامل ہیں جو سورہ لقمان کے بعد نازل ہوئی ہیں۔ اسے صبا کہا جاتا ہے کیونکہ اس میں اہلِ سبا کی کہانی ہے۔ سبا یمن میں رہنے والے عرب قبائل کے ایک قبیلے کا نام ہے۔ انہوں نے ایک مملکت کی بنیاد رکھی جسے سبائیہ بادشاہی کہا جاتا ہے، جس کا دارالحکومت معارب تھا۔ ایک بڑا ڈیم بنانے میں کامیاب رہے ہیں، جسے معارب ڈیم کہا جاتا ہے، تاکہ میکا ملک زرخیز اور خوشحال ہو۔ اس عیش و عشرت اور خوشحالی کی وجہ سے سبائی لوگ اللہ کو بھول گئے اور اس کا انکار کیا جس نے ان پر اپنی نعمتیں نازل کی تھیں اور انہوں نے رسولوں کی دعوت کا بھی انکار کیا۔ ان کی نافرمانی کی وجہ سے اللہ تعالیٰ نے ان پر سیل العریم (عظیم سیلاب) کا عذاب نازل کیا جو معارب بند ٹوٹنے سے آیا۔ معارب بند ٹوٹنے کے بعد سبا کی سرزمین خشک ہوگئی اور ان کی سلطنت تباہ ہوگئی۔

35. سورہ فاطر (سورہ فاطر) 45 آیات | مكة
سورہ فاتحر 45 آیات پر مشتمل ہے، مکی حروف کے گروپ سے تعلق رکھتی ہے، سورہ فرقان کے بعد نازل ہوئی اور قرآن کے حروف کی ترتیب کا آخری حرف ہے جو الحمدللہ سے شروع ہوتا ہے۔ نام فاطر (خالق) کا تعلق فاطر کے ان الفاظ سے ہے جو اس حرف کی پہلی آیت میں موجود ہیں۔ اس آیت میں اس بات کی وضاحت کی گئی ہے کہ اللہ زمین و آسمان کا خالق، فرشتوں کا خالق، کائنات کا خالق، یہ سب اس کی قدرت و عظمت کا ثبوت ہے۔ اس خط کو فرشتے کا خط بھی کہا جاتا ہے کیونکہ پہلی آیت میں بتایا گیا ہے کہ اللہ تعالیٰ نے فرشتوں کو اپنا رسول بنایا ہے جن کے کئی پر ہیں۔

36. سورہ یس (سورہ یاسین)، 83 آیات | مكة
خط یاسین 83 آیات پر مشتمل ہے جس میں مکی حروف بھی شامل ہیں، یہ خط جن کے بعد نازل ہوا۔ یاسین کا نام دیا گیا کیونکہ یہ حروف یاسین سے شروع ہوتا ہے۔ جیسا کہ حروف تہجی کا مفہوم ہے جو قرآن کے متعدد حروف کے شروع میں موجود ہے، اسی طرح اس حرف کی ابتدائی آیت میں موجود یاسین کے معنی، یعنی اللہ تعالیٰ نے اشارہ کیا کہ اس حرف کے بیان ہونے کے بعد اہم چیزیں شامل ہیں: خدا نے قرآن کی قسم کھائی ہے کہ محمد صلی اللہ علیہ وسلم واقعی ایک رسول اس نے ان لوگوں کے پاس بھیجا جو کبھی ان کے رسولوں کے پاس نہیں بھیجا گیا تھا۔

37. خط الصافات (سورۃ الصافات (درجہ بندی کرنے والوں کی صفیں))، 182 آیات | مكة
ایش شفیک ایبل خط 182 پیراگراف پر مشتمل ہے جس میں مکیہ خط بھی شامل ہے، یہ الانعام خط کے بعد نازل ہوا۔ اش شفاعتسات (جسے شفٹ کیا گیا تھا) کا نام اشش شفاعت بینیفٹ کے الفاظ سے کچھ تعلق تھا جو اس خط کی ابتدائی آیت میں ہے جس میں بتایا گیا ہے کہ جو فرشتے اپنی پاکیزہ زندگی کے سامنے صف آرا ہوتے ہیں، انہیں شیطان کس طرح آزمایا نہیں جا سکتا۔ یہ انسانوں کے لیے اپنے آپ کو اللہ پر لعنت بھیجنے کا اِتبار ہونا چاہیے۔

38. خط ص (سورہ اداس (اداس خط سعد)) ، 88 پیراگراف | امی
شاد خط 88 پیراگراف پر مشتمل ہے جس میں مککیہ لیٹر گروپ بھی شامل ہے ، جو القمر خط کے بعد انکشاف ہوا ہے۔ شاد کے ساتھ نامزد کیا گیا ہے کیونکہ یہ خط شاد سے شروع ہوتا ہے (پھر نہیں دیکھیں۔ [10))۔ اس خط میں خدا قرآن پاک کے ساتھ گھومتا ہے ، یہ ظاہر کرنے کے لئے کہ قرآن پاک ایک عمدہ کتاب ہے اور جو بھی اس کی پیروی کرتا ہے اسے دنیا اور اس کے بعد کی خوشی ملے گی اور یہ ظاہر کرنے کے لئے کہ قرآن مجید حضرت محمد ایس اے ڈبلیو کا ایک معجزہ ہے۔ جو اس کے اخلاق کی سچائی اور اونچائی میں بیان کرتا ہے۔

39. الکمر کا خط (سورہ از زومار (گروپوں کا گروپ)) ، 75 آیات | امی
اے زومر کا خط اٹاز 75 پیراگراف پر مشتمل تھا ، بشمول مککیہ خط ، صبا کے خط کے بعد انکشاف ہوا۔ AZ ZUMAR (گروپس) کا نام AZ زومار کے الفاظ 71 اور 73 میں شامل ہیں۔ ان آیات میں انصاف کے دن انصاف کے دن انسانی صورتحال کی وضاحت کی گئی تھی ، اس وقت ان کو دو گروہوں میں تقسیم کیا گیا تھا۔ ایک گروہ کو جہنم میں لایا گیا اور دوسرا گروہ جنت میں لے جایا گیا۔ ہر گروپ کو پہلے دنیا میں کیا کیا اس سے جواب ملا۔ اس خط کو آیت 20 میں موجود غفف کے الفاظ کی وجہ سے الغورف (کمرے کے کمرے) بھی کہا جاتا ہے ، جہاں جنت میں کمروں کی حالت متقیوں کے ذریعہ حاصل کی جاتی ہے۔

40. خط غaaur (سورہ گیفیر (معاف کرنے والے کے لئے سپلائی)) ، 85 آیات | امی
ال مومن کے خط میں 85 آیات پر مشتمل تھا ، بشمول مککیہ خط ، AZ زومر خط کے بعد انکشاف ہوا تھا۔ اس خط کی آیت 28 میں موجود مومنوں کے الفاظ کی وجہ سے ، المون (ایک شخص جو یقین کرتا ہے) کا نام لیا۔ آیت 28 میں یہ سمجھایا گیا ہے کہ فرعون میں سے ایک کا نبی موسیٰ امریکی پر اعتماد تھا۔ بیان سننے اور نبی موسیٰ کے ذریعہ پیش کردہ معجزات کو دیکھ کر ، اپنے لوگوں پر اپنے اعتماد کو چھپانے سے اس شخص کے چھوٹے دل نے فرعون اور اس کے لوگوں کی مذمت کی جو نبی موسیٰ امریکی پر یقین نہیں کرنا چاہتے تھے ، حالانکہ ان کی معلومات اور معجزات نے ان کی درخواست کی تھی (جو معاف کرتا ہے)۔ اس خط کی آیت 3 میں جملہ غفیر شامل ہے۔ یہ آیت یاد دلاتی ہے کہ توبہ کرنے کا سب سے فائدہ اور سب سے زیادہ وصول کنندہ خدا کی خوبیوں کا حصہ ہے ، لہذا خدا کے خادموں کو ان گناہوں کے اعمال کے بارے میں فکر کرنے کی ضرورت نہیں ہے جو انہوں نے پہلے ہی کیے ہیں ، ان سب کو خدا کو معاف کردیا جائے گا۔ جب تک کہ وہ واقعی معافی مانگتے ہیں اور اس سے توبہ کرتے ہیں اور وعدہ کرتے ہیں کہ دوبارہ گناہ کے عمل کو نہ کریں۔ اور اس خط کا نام دزیت تھول (جس کے پاس کارنیا ہے) رکھا گیا ہے کیونکہ یہ الفاظ پیراگراف 3 میں ہیں۔

41. الٹ کا خط (سورہ فوسیلٹ (تفصیلات میں بیان کردہ)) ، 54 پیراگراف | امی
فششیلات خط 54 آیات پر مشتمل ہے ، بشمول مککیہ خطوط ، یہ المومن خط کے بعد انکشاف ہوا ہے۔ فش شیلات (بیان کردہ) کا نام دیا گیا ہے کیونکہ اس کا تعلق اس خط کے آغاز میں پائے جانے والے فششیلات کے الفاظ کے ساتھ کرنا ہے جس کی وضاحت کی گئی ہے۔ اس کا مطلب یہ ہے کہ آیات قوانین ، ایمان ، وعدوں اور دھمکیوں ، کردار ، کہانیاں ، اور اسی طرح کے بارے میں واضح طور پر تفصیل سے ہیں۔ اس کا نام ہا مِم اور سجدہ بھی رکھا گیا کیونکہ اس خط کا آغاز ہا مِم سے ہوا تھا اور اس خط میں ایک آیت ہے۔

42. الکورى کا خط (سور Surah سیسی-سیورا (مشاورت سے متعلق مشاورت)) ، 53 آیات | امی
ایش سیورا خط 53 آیات پر مشتمل ہے ، جن میں مککیہ خطوط بھی شامل ہیں ، جن کا انکشاف فششیلات خط کے بعد کیا گیا ہے۔ اس خط کے پیراگراف 38 میں موجود سیورہ کے الفاظ سے لیا گیا ایش سیورہ (غور و فکر) کے نام سے منسوب۔ اس آیت میں ، اسلامی حکومت کی ایک بنیاد پر غور و فکر تھا۔ اس کا نام ہا مِم 'آئن سائن قاف بھی رکھا گیا کیونکہ اس خط کا آغاز حجیاہ کے خطوط سے ہوا تھا۔

43. الیگرف کا خط (سورہ اذ-زوکھروف (سونے کا زیورات کا زیور)) ، 89 آیات | امی
AZ ZUKHRUF کے خط میں 89 آیات شامل تھیں ، جن میں مککیہ خط بھی شامل ہے ، ایش سیورا خط کے بعد انکشاف ہوا۔ اس خط کی آیت 35 میں شامل AZ ZUKHRUF (زیورات) کے نام سے لیا گیا ہے۔  پولیٹیسٹ کسی زیورات اور جائیداد کے لحاظ سے کسی شخص کی اعلی ڈگری کی پیمائش کرتے ہیں ، کیونکہ محمد ایس اے ڈبلیو۔ کیا یتیم غریب ہے ، وہ خدا کے ذریعہ رسول اور نبی کے طور پر مقرر ہونے کا اہل نہیں ہے۔  رسول اور نبی کا درجہ دولت مندوں کو دینا چاہئے۔  یہ آیت اس بات کی تصدیق کرتی ہے کہ جائیداد کو کسی شخص کی ڈگری کی سطح کی پیمائش کرنے کی بنیاد کے طور پر استعمال نہیں کیا جاسکتا ، کیونکہ خزانہ دنیاوی زندگی کی دنیا ہے ، اس کا مطلب یہ نہیں ہے کہ اس کے بعد کی خوشی ہے۔

44. الدقان کا خط (سورہ اڈ-ڈوبن (دھواں دھواں)) ، 59 آیات | امی
دوکھان کے خط میں 59 آیات پر مشتمل تھا ، بشمول مککیہ خط ، AZ ZUKHRUF کے بعد انکشاف ہوا تھا۔ اس خط کی آیت 10 میں شامل دوکھان کے الفاظ سے لیان (دھند) کا نام دیا گیا ہے۔ حضرت محمد s.a.w. پہلے ہی اس حد کو عبور کرلیا ، لہذا نبی نے اللہ سے دعا کی کہ وہ اس سزا کا انکشاف کریں جیسا کہ ان لوگوں کے سامنے انکشاف کیا گیا ہے جو نابالغ جوزف ، یعنی طویل خشک موسم کے ساتھ بے دین تھے۔  اللہ کی طرف سے نبی of کی دعا اس وقت تک عطا کی گئی جب تک کہ بھوک کی وجہ سے کافر ہڈیوں اور لاشوں کو نہ کھائیں۔  وہ ہمیشہ خدا کی مدد کی توقع کرتے ہوئے آسمان کی طرف دیکھتے ہیں۔  لیکن ان میں سے کسی نے بھی دھند کے سوا نہیں دیکھا جس نے ان کے خیالات کو ڈھانپ لیا تھا تاکہ وہ نبی. کے پاس آگئے تاکہ بارش کو ختم کردیا گیا۔  اللہ نے نبی of کی دعا کی منظوری کے بعد ، اور بارش کا انکشاف ہوا ، وہ پہلے کی طرح کافروں میں واپس آئے۔ لہذا خدا بیان کرتا ہے کہ بعد میں وہ تکلیف دہ سزا کے درد میں ہوں گے۔

45. القعقیت کا خط (سورہ الجیسیہ (گھٹنے ٹیکنے کا تاج)) ، 37 آیات | امی
الجاتیہ کے خط میں 37 آیات پر مشتمل تھا ، بشمول مککیہ خط ، دوکھان کے خط کے بعد اسے نیچے منتقل کردیا گیا تھا۔ اس خط کی آیت 28 میں موجود Jaatihyah کے الفاظ سے لیا گیا ہے۔ اس آیت میں فیصلے کے دن انسانوں کی حالت کے بارے میں وضاحت کی گئی ہے ، یعنی ، تمام انسان خدا کی ہائی کورٹ کے سامنے جمع ہوتے ہیں جو دنیا میں ان کے اقدامات کو فیصلے دیتے ہیں۔ اس دن تمام انسان خدا کے سامنے گھٹنے ٹیکتے ہیں۔ اس خط کی آیت 18 میں شامل شریعت (شریعت) کے الفاظ سے بھی شریعت کا نام لیا گیا ہے۔

46. ​​خط القع (سورہ العقاف (بکیٹ ریت دی ٹیلوں)) ، 35 آیات | امی
الحقاف کے خط میں 35 آیات پر مشتمل ہے جس میں مککیہ خط بھی شامل ہے ، اس کے بعد سورہ الجاتیہ کے بعد گزر گیا۔ الحقاف (ریت کی پہاڑیوں) کا نام الحقاف کے الفاظ سے اس خط کی آیت 21 میں شامل ہے اور اس کے بعد آیات نے وضاحت کی کہ نبی hud ہڈ اے۔ الحقاف میں اپنے لوگوں کو اپنا مقالہ پہنچا دیا ہے ، جسے اب اے آر ربی الخالی کے نام سے جانا جاتا ہے ، لیکن ان کے لوگ باقی رہے حالانکہ انہیں پچھلے رسولوں نے بھی انتباہ دیا تھا۔  آخر خدا نے انہیں تیز ہواؤں سے تباہ کردیا۔  یہ خدا کی طرف سے قریش پولی کے لئے ایک علامت کے طور پر ہے کہ اگر وہ رسول کی پکار پر توجہ نہ دیں تو وہ تباہ ہوجائیں گے۔

47. خط محمد (سورہ محمد (محمد محمد)) ، 38 پیراگراف | مدیدی
محمد کے خط میں 38 آیات پر مشتمل تھا ، جن میں مدنیہ لیٹرز سمیت ، الدیہیڈ خط کے بعد گزر گیا تھا۔ اس خط کے نام کے طور پر محمد کا نام اس خط کے پیراگراف 2 میں موجود محمد کے الفاظ سے لیا گیا تھا۔ اس خط کی آیات 1 ، 2 ، اور 3 میں ، اللہ ان لوگوں کے ذریعہ حاصل کردہ نتائج کا موازنہ کرتا ہے جو اس بات پر یقین نہیں کرتے ہیں کہ حضرت محمد s.a.w پر جو انکشاف ہوا تھا اور ان کے ذریعہ حاصل کردہ نتائج جو ان پر یقین نہیں رکھتے تھے۔ وہ لوگ جو محمد ایس اے نے ان کو لائے اس پر یقین رکھتے ہیں کہ وہ وہ لوگ ہیں جو حقوق پر یقین رکھتے ہیں اور ان کی پیروی کرتے ہیں ، خدا نے ان کے تمام اعمال قبول کیے ہیں ، ان کی ساری غلطیوں کو معاف کردیا۔ جہاں تک وہ محمد ایس اے پر یقین نہیں رکھتے ہیں وہ لوگ ہیں جو ان کے اعمال کو قبول نہیں کیا جاتا ہے ، ان کے گناہوں کو معاف نہیں کیا جاتا ہے ، ان کے لئے دنیا اور اس کے بعد ایک سزا کا وعدہ کیا جاتا ہے قانون کے ساتھ ساتھ یہ بھی کہ کافروں کے ساتھ مومنوں کا رویہ ہونا چاہئے۔

48. خط القیت (سورہ الف فیتھ (فتح فتح)) ، 29 آیات | مدیدی
الفتھ کا خط 29 آیات پر مشتمل ہے ، بشمول مدنیہ لیٹرز ، الجومہ کے خط کے بعد گزر گئے۔ اس خط کی پہلی آیت میں موجود فیٹ ہان کے الفاظ سے الفتھ (فتح) لیا گیا ہے۔ اس خط کی زیادہ تر آیات نبی صلی اللہ علیہ وسلم کے ذریعہ حاصل کردہ فتح سے متعلق معاملات کی وضاحت کرتی ہیں۔ جنگ میں نبی کریم صلی اللہ علیہ وآلہ وسلم۔ اس خط کی پہلی آیت کے زوال سے بہت خوش ہوں۔ یہ جوش و خروش بخاری کے بیان کردہ ان کے الفاظ میں بیان کیا گیا تھا۔ در حقیقت ، یہ میرے سامنے ایک خط کا انکشاف ہوا ہے ، یہ خط جس سے میں واقعتا the ان سب سے زیادہ پیار کرتا ہوں جو سورج کو روشن کیا گیا تھا۔ حضرت محمد s.a.w. کی جوش و خروش اس کی وجہ یہ ہے کہ آیات نے فتح کے بارے میں وضاحت کی ہے کہ محمد ایس اے ڈبلیو۔ اس کی جدوجہد میں اور اس سے خدا کی برکتوں کے کمال کے بارے میں۔

49. القراط کا خط (سورہ الحوجورات (اندرونی اپارٹمنٹس کے کمرے)) ، 18 آیت | مدیدی
الحوجورات کا خط 18 آیات پر مشتمل ہے ، جن میں مدنیہ کے خطوط بھی شامل ہیں ، اس کا انکشاف المجاہ کے خط کے بعد ہوا۔ اس خط کی آیت 4 میں شامل الحجورات کے الفاظ سے الحجورات نامی نام لیا گیا ہے۔ اس آیت نے ان دوستوں کی مذمت کی جنہوں نے حضرت محمد صلی اللہ علیہ وآلہ وسلم کو اپنی بیوی کے ساتھ اپنے کمرے میں تھا۔ حضرت محمد کو ایک طرح سے اور ایسے حالات میں پکارنا اس کی بے عزتی کو ظاہر کرتا ہے اور اس کی امن کو پریشان کرتا ہے۔

50. خط ق (سورہ قاف (قافف لیٹر قاف)) ، 45 آیات | امی
کیو اے ایف کے خط میں 45 آیات پر مشتمل ہے ، بشمول مککیہ خطوط ، یہ المرسالات خط کے بعد انکشاف ہوا ہے۔ قافف کا نام دیا کیونکہ یہ خط قافی کے خط سے شروع ہوتا ہے۔ مسلم پجاری کے ذریعہ بیان کردہ حدیث کے مطابق ، کہ نبی نے اس خط کو صبح کے وقت اور چھٹی کی نماز کے موقع پر پہلی راکاہ کی نماز میں پڑھ کر خوشی محسوس کی۔ جبکہ ابو داؤد کی تاریخ کے مطابق ، الباہقی اور ابن ماجاہ کہ رسول اللہ نے جمعہ کے روز خطبہ کے ہر پڑھنے میں یہ خط پڑھتے دیکھا۔ ان دونوں بیانات سے پتہ چلتا ہے کہ قاف کا خط اکثر حضرت محمد نے عوامی مقامات پر پڑھا ہے ، تاکہ انسانوں کو ان کے واقعات اور اس کو دی جانے والی نعمتوں کے ساتھ ساتھ دلیل کے دن ، تحفہ کے دن ، جنت کے بارے میں بھی متنبہ کیا جاسکے۔ ، جہنم ، انعام ، گناہ ، وغیرہ۔ اس خط کا نام الباسقات بھی رکھا گیا تھا ، جو اس خط کی آیت 10 میں شامل الباسقاٹ کے الفاظ سے لیا گیا تھا۔

51. القعرایت کا خط (سورہ ایز زریت (ہوا سے چلنے والی ہواؤں کو اڑ رہی ہے)) ، 60 آیت | امی
ADZ DZAARIYAT خط میں 60 آیات پر مشتمل ہے ، جس میں مککیہ خط بھی شامل ہے ، یہ الحقاف کے خط کے بعد انکشاف ہوا ہے۔ اس خط کی پہلی آیت میں شامل اڈز ڈزاریات کے الفاظ سے لیا گیا ، اڈز ڈزاریات (دی ونڈ فلائنگ) کے نام سے منسوب۔ خدا ہوا ، میگا ، صندوق ، اور فرشتے جو خوشحالی اور خوشحالی کا ذریعہ ہے۔ اس کے لئے اپنے خادموں کے لئے خدا کو بے چین کرنے کی ضرورت ہے۔

52. الکور کا خط (سورہ اٹ ٹور (بکیٹ تورسینا دی ماؤنٹ)) ، 49 آیات | امی
اتھور کے خط میں 49 آیات پر مشتمل تھا ، بشمول مککیہ خط ، بطور سجدہ خط کے بعد اسے منتقل کردیا گیا تھا۔ اس خط کی پہلی آیت میں شامل اتھور کے الفاظ سے لیا گیا ہے۔ یہاں پہاڑی سے کیا مراد ہے وہ بوکیٹ تھرسنا ہے جو جزیرہ نما سینا پر واقع ہے ، جہاں نبی موسیٰ کو اپنے رب کی طرف سے ایک انکشاف ہوا۔

53. النجم کا خط (سورہ ان نجیم (اسٹار دی اسٹار)) ، 62 آیت | امی
ایک NAJM کا خط 62 آیات پر مشتمل ہے ، جس میں مککیہ خطوط بھی شامل ہیں ، جو الکھلاش کے بعد اخذ کیے گئے ہیں۔ اس خط کی پہلی آیت میں موجود ایک NAMM کے الفاظ سے لیا گیا نام (بنٹانگ) نام ہے۔ خدا نجم (ستاروں) کے ساتھ گھومتا ہے اس کی وجہ یہ ہے کہ وہ ستارے جو پیدا ہوتے ہیں اور ڈوبتے ہیں ، انسانوں کے لئے بہت فائدہ مند ہیں ، سمندر میں سفر کرنے میں انسانوں کے لئے ایک رہنما کے طور پر ، صحرا میں سفر پر ، موسموں کی گردش کا تعین کرنے کے لئے اور اسی طرح پر

54. خط الخمر (سورہ القمر (مہینہ چاند)) ، 55 آیات | امی
القمر کے خط میں 55 آیات پر مشتمل ہے ، جس میں مککیہ خطوط بھی شامل ہیں ، اتھارق کا خط کم کردیا گیا تھا۔ نام القامار (چاند) اس خط کی پہلی آیت میں شامل القامار کے الفاظ سے لیا گیا ہے۔ اس آیت میں چاند کو تقسیم کرنے کے بارے میں وضاحت کی گئی ہے کہ حضرت محمد s.a.w. کے معجزہ کے طور پر۔

55. الرقمن کا خط (سورہ آر الرحمن (سب سے زیادہ سنیارٹی بینیفٹ)) ، 78 آیت | مدیدی
اے آر رحمان کا خط 78 آیات پر مشتمل تھا ، جن میں مدنیہ خط بھی شامل ہے ، اے آر راؤڈو خط کے بعد اسے نیچے منتقل کردیا گیا تھا۔ اس خط کی پہلی آیت میں موجود آر رحمان کے الفاظ سے لیا گیا آر رحمان (سب سے بڑا) نامزد کیا گیا ہے۔ اے آر رحمان خدا کے ناموں میں سے ایک ہے۔ اس خط کا بیشتر حصہ اللہ کی ملکیت کی وضاحت کرتا ہے۔ اپنے خادموں کو ، یعنی دنیا میں اور اس کے بعد دونوں میں لامحدود احسان دے کر۔

56. الوواعق کا خط (سورہ الواقیہ (یومیہ فیصلے ناگزیر)) ، 96 آیات | امی
سورہ الواقیہ 96 آیات پر مشتمل ہے ، بشمول مککیہ خطوط ، جس میں تھاہ ہا کے خط کے بعد انکشاف ہوا ہے۔ 	اس خط کی پہلی آیت میں شامل ال واقیہ کے الفاظ سے لیا گیا الواقیہ (قیامت کے دن) کا نام لیا گیا۔

57. خط القدیاد (سورہ الحدید (آئرن آئرن)) ، 29 آیات | مدیدی
الہدید کے خط میں 29 آیات پر مشتمل تھا ، جن میں مدنیہ خط بھی شامل ہے ، AZ ZALZALAH خط کے بعد انکشاف ہوا۔ اس خط کے پیراگراف 25 میں شامل ال ہادیڈ کے الفاظ سے لیا گیا الہدیڈ (آئرن) کا نام لیا گیا ہے۔

58. المقادلة کا خط (سورہ المجدالہ (مقدمہ چلانے والی عورت)) ، 22 آیت | مدیدی
المجدیلہ کے خط میں 22 آیات پر مشتمل تھا ، جن میں مدنیہ خط بھی شامل ہے ، اس کے بعد سورہ ال مونافیکون کے بعد منظور کیا گیا تھا۔ اس خط کا نام المجدیلہ (وہ خاتون جس نے مقدمہ دائر کیا تھا) کا نام لیا گیا ہے کیونکہ ابتدا میں اس خط کا ذکر ایک عورت کی تردید نے کیا تھا ، اس کے شوہر کے روی attitude ے کے بارے میں خولہ بنٹی تس اللہ نامی تاریخ کے مطابق جس نے اسے دکھایا تھا۔ اس کی شکایت نبی S.A.W. اور اس نے مطالبہ کیا کہ وہ اس معاملے پر منصفانہ فیصلہ کریں۔ اس کا نام المجا بھی ہے جس کا مطلب ہے ریفینس۔

59. لیٹر آف الشر (سورہ الحسیر (جلاوطنی ایگزیکٹو)) ، 24 آیت | مدیدی
الحسیر کا خط 24 آیات پر مشتمل ہے ، جن میں مدنیہ کے خطوط بھی شامل ہیں ، جو البیانہ کے خط کے بعد اخذ کیے گئے ہیں۔ 	اس خط کے پیراگراف 2 میں شامل الحسیر کے الفاظ سے نامزد سورہ الحسیر (بے دخل) لیا گیا ہے۔ اس خط میں ، ایک یہودی قبیلے کے بے دخل ہونے کی کہانی جو بنی ندھیر نامی ہے جو مدینہ شہر کے آس پاس رہتا ہے۔

60. خط الممتہنیة (سورہ الممتاہنا (جس عورت نے اس کی جانچ کی ہے اس کا تجربہ کیا)) ، 13 آیات | مدیدی
الممتانہ کا خط 13 آیات پر مشتمل ہے ، جن میں مدنیہ لیٹرز بھی شامل ہیں ، الحزاب کے خط کے بعد اسے منظور کیا گیا ہے۔ نام العمتھانا (جس عورت کو آزمایا جارہا ہے) کا نام دیا گیا ، جس کا لفظ "فیمتاہینوہونا" سے لیا گیا ہے جس کا مطلب ہے کہ وہ ان کی جانچ کرتے ہیں ، جو اس خط کی آیت 10 میں ہیں۔

61. الک کا خط (سورہ AS-Saff (صفوں کی صفیں) ، 14 پیراگراف | مدیدی
ایش شیف لیٹر میں مدنیہ کے خطوط سمیت 14 آیات پر مشتمل ہے۔ ایش شیف کے نام سے منسوب ، کیونکہ آیت 4 میں یہ خط لفظ شفن ہے جس کا مطلب ہے ایک لائن۔ یہ آیت اس کی وضاحت کرتی ہے کہ خدا نے کیا برکت دی اس کی وضاحت کے بعد اس نے کیا لپیٹ لیا۔ آیت 3 میں یہ سمجھایا گیا ہے کہ خدا ان لوگوں کے لئے ناراض ہے جو صرف یہ کہنے میں صرف اچھے ہیں لیکن جو کچھ اس نے کہا اسے انجام نہیں دیتے ہیں۔ اور آیت 4 میں یہ سمجھایا گیا ہے کہ خدا ان لوگوں کو پسند کرتا ہے جو اس کی بات پر عمل کرتے ہیں جو وہ کہتے ہیں وہ وہی لوگ ہیں جو ایک ہی سطر میں خدا کی راہ میں لڑتے ہیں۔

62. القمعة کا خط (سورہ الجوموہ (جمعہ جمعہ)) ، 11 آیات | مدیدی
یہ ال جموہ خط 11 آیات پر مشتمل ہے ، جس میں مدنیہ کے خطوط کے گروپس بھی شامل ہیں اور ایش شاف کے خط کے بعد نیچے چلے گئے۔ ال جموہ کے خط کا نام اس خط کی آیت نمبر 9 میں شامل لفظ ال جموہ سے لیا گیا ہے جس کا مطلب ہے: جمعہ۔

. 63. خط المناؤن (سورہ المونافیقون (منافق منافق)) ، 11 آیات | مدیدی
اس خط میں 11 آیات پر مشتمل ہے ، جن میں مدنیہ خطوط بھی شامل ہیں ، جو الحج خط کے بعد اخذ کیے گئے ہیں۔ اس خط کا نام المونافیکون رکھا گیا ہے جس کا مطلب منافق ہے ، کیونکہ یہ خط منافقوں کی خصوصیات کو ظاہر کرتا ہے۔

64. خط الطازابن (سورہ اٹ-تاگابن (باہمی مایوسی کی غلطیوں کا انکشاف)) ، 18 آیت | مدیدی
اس خط میں 18 آیات پر مشتمل ہے ، جن میں مدنیہ کے خطوط بھی شامل ہیں اور تحریم کے خط کے بعد انکشاف ہوا ہے۔ ٹیگھاابن میں نام آیت 9 میں موجود ٹیگھاابن کے لفظ سے لیا گیا ہے جس کا مطلب ہے کہ اس دن کو غلطیاں دکھائی گئیں۔

65. خط الکلا a (سورہ اتلاق (طلاق طالق) ، 12 آیت | مدیدی
اس خط میں 12 آیات پر مشتمل ہے ، جن میں مدنیہ خطوط بھی شامل ہیں ، جو المنڈ کے خط کے بعد اخذ کیے گئے ہیں۔ اس خط کا نام اتھ تھالق ہے کیونکہ طلاق کے مسئلے سے متعلق زیادہ تر آیات اور اس مسئلے سے متعلق ہیں۔

66. التسریم کا خط (سورہ اٹ-تہریم (ممنوعہ نقصان)) ، 12 آیت | مدیدی
یہ خط 12 آیات پر مشتمل ہے ، جن میں مدنیہ خطوط بھی شامل ہیں ، جو الحجورات کے خط کے بعد اخذ کیے گئے ہیں۔ طھرم میں خط کا نام دیا کیونکہ اس خط کے آغاز میں ایک لفظ توہاررم تھا جس کی اصلیت اتھرم تھی جس کا مطلب ہے حرام تھا۔

67. خط الملہ (سورہ المولک (بادشاہی کی خودمختاری)) ، 30 آیت | امی
اس خط میں 30 آیات پر مشتمل ہے ، بشمول مککیہ خطوط ، جو اتھور کے بعد اخذ کیے گئے ہیں۔ نام الملک لفظ ال ملک سے لیا گیا ہے جو اس خط کی پہلی آیت میں موجود ہے جس کا مطلب ہے بادشاہی یا طاقت۔ اس خط کا نام تبارک (سب سے زیادہ مقدس) کے ساتھ بھی رکھا گیا ہے۔

68. خط الکلم (سورہ القلم (قلم قلم)) ، 52 آیات | امی
یہ خط 52 آیات پر مشتمل ہے ، بشمول مککیہ خطوط کے گروپ ، اللہ کے خط کے بعد انکشاف کیا گیا ہے۔ القم کا نام اس خط کی پہلی آیت میں شامل لفظ القم سے لیا گیا ہے جس کا مطلب قلم ہے۔ اس خط کا نام لیٹر نون (خط نون) بھی رکھا گیا ہے۔

69. العق (سورہ الحقاہ (یومیہ فیصلے حقیقت)) کا خط) ، 52 آیات | امی
یہ خط 52 آیات پر مشتمل ہے ، بشمول مککیہ خطوط ، الملک کے خط کے بعد اخذ کیے گئے ہیں۔  الحققہ کا نام اس خط کی پہلی آیت میں شامل لفظ الحققہ سے لیا گیا ہے جس کا مطلب ہے قیامت کا دن

70. المعاری کا خط (سورہ المعاریج (جہاں چڑھائی سیڑھیوں پر سوار ہونا ہے)) ، 44 آیات | امی
یہ خط 44 پیراگراف پر مشتمل ہے ، بشمول مککیہ خطوط ، الحقق کے خط کے بعد انکشاف کیا گیا ہے جو اس خط کا نام بن گیا ہے۔ پیراگراف 3 ، جس کا مطلب ہے اس زبان کے مطابق جہاں یہ طلوع ہوتا ہے۔ جبکہ ترجمان بہت سارے معنی دیتے ہیں ، جن میں جنت ، تحائف اور ڈگری یا سطحیں شامل ہیں جن میں اللہ S.W.T نے جنت کے ماہرین کو دیا ہے۔

71. خط نوز (سورہ نوح (نوح نوح)) ، 28 پیراگراف | امی
اس خط میں 28 پیراگراف پر مشتمل ہے ، بشمول مککیہ خطوط ، جس میں خط کے بعد اخذ کیا گیا ہے۔ نوح کے خط کے ساتھ نامزد کیا گیا ہے کیونکہ یہ خط سب حضرت نوح اے ایس کی داؤ اور دعا کی وضاحت کرتا ہے۔

72. القان کا خط (سورہ الجن (جن جن)) ، 28 آیات | امی
ال جن کے خط میں 28 آیات پر مشتمل تھا ، بشمول مککیہ خط ، الحراف کے خط کے بعد اسے منظور کیا گیا تھا۔ ال جن کے نام سے اس خط کی پہلی آیت میں شامل ال جن کے الفاظ سے لیا گیا ہے۔ اس آیت میں اور اگلی آیات نے یہ سمجھایا کہ جن کی حیثیت سے جن کو روحوں نے قرآن پاک پڑھتے ہوئے سنا تھا اور انہوں نے قرآن کی تعلیمات پر عمل کیا۔

73. الممل کا خط (سورہ المزمل (جو لوگ جو ایک میں شامل ہیں)) ، 20 آیات | امی
سورت المزمل میں 20 آیات پر مشتمل تھا ، بشمول مککیہ کا خط ، اللہم کے خط کے بعد (ایک شخص جس کا احاطہ کیا گیا تھا) کے بعد اس خط کی پہلی آیت میں موجود تھا۔ اس شخص سے کیا مراد ہے جو ایک نبی محمد s.a.w.

74. المدڈر کا خط (سورہ المدسیر (ایسے افراد جن کے پاس ایک ہنگامہ ہے)) ، 56 آیات | امی
ال مدتسیر خط 56 آیات پر مشتمل تھا ، بشمول مککیہ خط ، المزمل خط کے بعد انکشاف ہوا تھا۔ 	اس خط کی پہلی آیت میں شامل ال مدتسٹسیر (ایک شخص جس کے پاس ایک لفظ ہے) کے نام سے لیا گیا ہے۔

75. لیٹر الیجی عمومی (سورہ القیاماہ (قیامت کے دن قیامت) ، 40 آیت | امی
القعامہ کا خط 40 آیات پر مشتمل ہے ، جن میں مککیہ خطوط بھی شامل ہیں ، القاعدہ کے خط کے بعد گزر گئے۔ اس خط کی پہلی آیت میں شامل القائمہ (ڈومس ڈے) کے نام سے منسوب القعامہ کے الفاظ سے لیا گیا ہے۔

76. خط الانیسن (سورہ السن (انسان آدمی)) ، 31 آیت | مدیدی
المند سورہ 31 آیات پر مشتمل ہے ، جن میں مدنیہ خطوط بھی شامل ہیں ، جو آر رحمان خط کے بعد اخذ کیے گئے ہیں۔ اس خط کی پہلی آیت میں ال خدا کے الفاظ سے الاسن (انسان) کے نام سے لیا گیا ہے۔

77. خط المرسلات (سورہ المرسلات (سفیروں کے ذریعہ بھیجے گئے فرشتوں)) ، 50 آیات | امی
المرسالات کے خط میں 50 آیات پر مشتمل تھا ، بشمول مککیہ خط ، الومزہ کے خط کے بعد انکشاف ہوا تھا۔ اس خط کی پہلی آیت میں شامل ال مرسالات کے الفاظ سے لیا گیا المرسالات (فرشتوں کو بھیجا گیا) نامزد کیا گیا ہے۔ اس خط کے پیراگراف 1 میں موجود اممہ یاتاسا الوون کے الفاظ سے بھی امما یاتاسا الوون کا نام لیا گیا تھا۔

78. النبإ کا خط (سورہ ان نابا '(اعلان کی بڑی خوشخبری) ، 40 آیت | امی
ایک نیبا خط 40 آیات پر مشتمل ہے ، بشمول مککیہ لیٹرز ، ال ماآراریج خط کے بعد اسے منتقل کردیا گیا تھا۔ اس خط کی آیت 2 میں شامل نیبا کے الفاظ سے لی گئی نیبا (بڑی خبر) کا نام دیا گیا ہے۔ اس خط کے پیراگراف 1 میں موجود اممہ یاتاسا الوون کے الفاظ سے بھی امما یاتاسا الوون کا نام لیا گیا تھا۔

79. خط النععط (سورہ ان نازیت (فرشتہ جو ان لوگوں کو منسوخ کرتا ہے جو آگے بڑھتے ہیں)) ، 46 آیات | امی
ایک نازیت کا خط 46 آیات پر مشتمل ہے ، جس میں مککیہ خطوط بھی شامل ہیں ، یہ ایک نیبا ´ کے خط کے بعد انکشاف ہوا ہے۔ اس خط کی پہلی آیت میں موجود نازیت کے الفاظ سے ایک نازیات نام لیا گیا تھا۔ اس کا نام صحیرہ بھی ہے جسے آیت 14 سے لیا گیا تھا ، اس کا نام بھی تھاماہ بھی آیت 34 سے لیا گیا تھا۔

80. خط بابس (سورہ 'اباسا (کھٹا چہرہ جس نے اسے فروغ دیا)) ، 42 آیات | امی
خط 'اباسا 42 آیات پر مشتمل ہے ، بشمول مککیہ خطوط ، خط کے ایک نجم کے بعد اسے نیچے منتقل کردیا گیا تھا۔ اس خط کی پہلی آیت میں موجود 'اباسا ان الفاظ سے لیا گیا ہے' اباسا۔ تاریخ کے مطابق ، ایک وقت میں اللہ کے رسول اللہ s.a.w. قریش کے رہنماؤں سے وصول کریں اور ان سے بات کریں جس کی انہیں امید تھی کہ وہ اسلام قبول کریں گے۔ اسی اثنا میں ابن عمی مکتم آیا ، جو ایک نابینا دوست تھا ، جس نے امید کی تھی کہ اللہ کے رسول اللہ S.A.W. اس کو قرآن کی آیات پڑھیں جو خدا گزر چکا ہے۔ لیکن نبی s.a.w. تیزابیت کا شکار اور اندھے ابن امی مکتم کا چہرہ پھیر گیا ، پھر اللہ نے ابن عمی مکتم کے بارے میں نبی of کے روی attitude ے کی سرزنش کے طور پر اس خط کو نیچے کردیا۔

81. التسوئیر کا خط (سورہ اتاکویر (تختہ الٹنے کا حکم)) ، 29 آیات | امی
تکویر میں خط 29 آیات پر مشتمل ہے اور اس میں مککیہ خطوط کا گروپ بھی شامل ہے ، جو العماد کے خط کے بعد انکشاف ہوا ہے۔ اس خط کا نام جو اس خط کا نام ہے اس کا لفظ اس خط کی پہلی آیت میں موجود فعل کووایرات (رولڈ) کے لفظ اصل (مشار) سے ہے۔

82. خط الکحار (سورہ ال انفیٹر (سپلٹ دی کلیمنگ)) کا خط) ، 19 آیات | امی
اس خط میں 19 آیات پر مشتمل ہے ، جس میں مککیہ خطوط کے گروپ سمیت اور خط کے بعد ایک نازیت کے بعد گزر گیا۔ ال انفیتھار جو اس خط کے نام کے طور پر استعمال ہوتا ہے وہ پہلی آیت میں شامل لفظ انفتھارت (اسپلٹ) کی اصل ہے۔

83. المِسین کا خط (سورہ المطاففین (دھوکہ دہی دھوکہ دہی)) ، 36 آیات | امی
اس خط میں 36 آیات پر مشتمل ہے ، بشمول مککیہ خطوط ، جس میں الانکا بوٹ کے خط کے بعد انکشاف کیا گیا ہے اور ہجرت کرنے سے پہلے مکہ میں آخری خط ہے۔ اس خط کے نام کے طور پر استعمال کیا جاتا ہے التتففین جو پہلی آیت میں شامل لفظ ال مٹھاففین سے لیا گیا ہے۔

84. خط القنیشق (سورہ ال انیسقق (تقسیم شدہ کھلی تقسیم)) ، 25 آیات | امی
سورت ال انسائقق ، جس میں 25 آیات پر مشتمل ہے ، جس میں مککیہ خطوط کے گروپ سمیت ، ال انفیتھار خط کے بعد انکشاف ہوا تھا۔ الاسیاقق (اسپلٹ) کا نام ، خدا انسیاکقات کے الفاظ سے لیا گیا جو اس خط کے آغاز میں پایا جاتا ہے ، اس کی اہم بات یہ کہیئقق تھی۔

85. البروک کا خط (سورہ البوروج (کنٹیلیشن اسٹار کا کلسٹر) ، 22 آیت | امی
ال بوروج کا خط 22 آیات پر مشتمل ہے ، بشمول مککیہ لیٹرز ، اس خط کے پیراگراف 1 میں شامل الوروج کے الفاظ سے ایش سیمز کے خط کے بعد یہ انکشاف ہوا۔

86. خط القارق (سورہ اتارق (جو رات کو صبح کے ستارے میں آتا ہے)) ، 17 آیات | امی
اتھیرق کے خط میں 17 آیات پر مشتمل تھا ، بشمول مککیہ خط ، ال بالاد خط کے بعد اسے نیچے منتقل کردیا گیا تھا۔  اس خط کے پیراگراف 1 میں شامل اتھیرق کے الفاظ سے لیا گیا تھا جو اتھارق (جو رات کو آیا تھا) کے نام سے لیا گیا تھا۔

87. خط الق الع ہی (سورہ الاولا (سب سے زیادہ اونچا)) ، 19 آیت | امی
اس خط میں 19 آیات پر مشتمل ہے ، جس میں مککیہ خطوط کا گروپ بھی شامل ہے ، اور تکیئر کے خط کے بعد انکشاف ہوا ہے۔ الالا کا نام پہلی آیت میں شامل لفظ الاولا سے لیا گیا ہے ، جس کا مطلب سب سے زیادہ ہے۔ مسلمانوں نے کتاب ال جمو ah ا میں بیان کیا ، اور اشھابوس سنن کے ذریعہ یہ بھی بیان کیا گیا ، نو مین ابن بسیر سے کہ اللہ کے رسول اللہ s.a.w. دو تعطیلات میں (فٹری اور اڈھا) اور جمعہ کی دعاؤں نے پہلے راکہ پر الحلا کا خط اور دوسرے راکہ پر سورہ الغاسیہ پر پڑھا۔

88. القعقیت کا خط (سورہ الغیہیہ (یومیہ فیصلے کا دن)) ، 26 آیات | امی
اس خط میں 26 آیات پر مشتمل ہے ، بشمول مککیہ لیٹرز ، ایڈز ڈزارات کے خط کے بعد گزر گئے۔ غاسیہ کا نام اس خط کی پہلی آیت میں شامل لفظ الغاسیہ سے لیا گیا ہے جس کا مطلب ایک خوفناک واقعہ ہے ، لیکن اس کا مطلب یہ ہے کہ فیصلے کا دن ہے۔ یہ خط ایک خط ہے جو نبی اکثر چھٹیوں اور جمعہ کی دعاؤں کی دعاؤں پر دوسرے راکہ پر پڑھتا ہے

89. الکر کا خط (سورہ الفجر (فجر ڈان)) ، 30 آیت | امی
اس خط میں 30 آیات پر مشتمل ہے ، بشمول مککیہ خطوط ، الل لیل لیٹر کے بعد انکشاف کیا گیا ہے۔ الفجر نام اس خط کی پہلی آیت میں شامل لفظ الفجر سے لیا گیا ہے جس کا مطلب ہے ڈان۔

90. خط البلڈ (سورہ البالاد (شہر کا ملک)) ، 20 آیت | امی
ال بالاد خط 20 آیات پر مشتمل ہے ، جس میں مککیہ خطوط بھی شامل ہیں ، یہ قافی کے خط کے بعد انکشاف ہوا ہے۔ اس خط کی پہلی آیت میں شامل ال بالاد کے الفاظ سے لیا گیا البالاد نامی ہے۔ یہاں شہر سے مراد شہر مکہ ہے۔

91. خط الکیمس (سورہ آشیم (ماتاہری دی سن)) ، 15 آیات | امی
ایش سیمس لیٹر 15 آیات پر مشتمل ہے ، جس میں مککیہ خط بھی شامل ہے ، یہ القاعدہ کے خط کے بعد انکشاف ہوا ہے۔  اس خط کی ابتدائی آیت میں پائے جانے والے ایش سائمز کے الفاظ سے ایش سیمس (سن) نامی نام لیا گیا ہے۔

92. اللیلیل کا خط (سورہ ال-لیل (نائٹ دی نائٹ)) ، 21 آیت | امی
اس خط میں 21 آیات پر مشتمل ہے ، بشمول مککیہ خطوط ، الالا کے خط کے بعد اخذ کیے گئے ہیں۔ اس خط کا نام ال لیل (نائٹ) رکھا گیا ہے ، جو اس خط کی پہلی آیت میں شامل ال لیل کے الفاظ سے لیا گیا ہے

93. خط کا خط (سورہ ادوحہ (دوہا صبح کے اوقات)) ، 11 آیات | امی
اس خط میں 11 آیات پر مشتمل ہے ، جس میں ماکیہ خط بھی شامل ہے اور ال فجر خط کے بعد اسے منتقل کردیا گیا ہے۔ ADH دھوہا نام پہلی آیت میں شامل الفاظ سے لیا گیا ہے ، جس کا مطلب ہے: جب سورج طلوع ہوتا ہے۔

94. القیرح کا خط (سور Surah س آسی-سیاڑھ (فیلڈ دی تسلی)) ، 8 آیت | امی
اس خط میں 8 آیات پر مشتمل ہے ، جس میں مککیہ خطوط کا گروپ بھی شامل ہے اور ADH دھوہا خط کے بعد گزر گیا۔ نسیرہ کی نوعیت کا نام پہلی آیت میں موجود قدرتی نسیرہ کے لفظ سے لیا گیا ہے ، جس کا مطلب ہے: کیا ہم اس کی وضاحت نہیں کر رہے ہیں۔

95. خط التیان (سورہ اٹ ٹن (ٹن فگ پھل)) ، 8 آیت | امی
اس خط میں 8 آیات پر مشتمل ہے ، بشمول مککیہ خطوط کے گروپ ، الورووج کے خط کے بعد گزر گئے۔ ٹائن میں نام اس خط کی پہلی آیت میں موجود ٹائن کے لفظ سے لیا گیا ہے جس کا مطلب ہے ٹن۔

96. العلق کا خط (سورہ العلق (جمنے کا ایک گانٹھ)) ، 19 آیات | امی
سورہ ال العق 19 آیات پر مشتمل ہے ، جس میں مککیہ کے خطوط بھی شامل ہیں۔ اس خط کی آیات 1 سے 5 قرآن کی پہلی آیات ہیں ، یعنی جب حضرت محمد s.a.w. ہیرا غار میں مبارک ہو۔ اس خط کا نام ال العق (خون کا ایک گانٹھ) رکھا گیا ہے ، جو اس خط کے پیراگراف 2 میں شامل الاق کے الفاظ سے لیا گیا ہے۔ اس خط کو اقرا یا القلم کا نام بھی دیا گیا ہے۔

97. خط القودر (سورہ القدر (طاقت کی شان ، تقدیر)) ، 5 آیات | امی
القادر کا خط 5 آیات پر مشتمل ہے ، بشمول مککیہ خطوط ، خط کے بعد ابسا کے بعد اخذ کیے گئے ہیں۔ اس خط کا نام القدر (گلوری) رکھا گیا ہے ، جو اس خط کی پہلی آیت میں شامل القادر کے الفاظ سے لیا گیا ہے۔

98. سورۃ البیینۃ (سورۃ البیینۃ)، 8 آیات | شہر
سورۃ البینہ 8 آیات پر مشتمل ہے، جن میں مدنی سورتوں کا گروپ بھی شامل ہے، جو سورۃ الطلاق کے بعد نازل ہوئی ہیں۔ اس خط کی پہلی آیت میں موجود لفظ البیینہ سے لیا گیا البیینہ (حقیقی ثبوت) کا نام دیا گیا ہے۔

99. سورۃ الزلزلہ (سورۃ الزلزلہ (زلزلہ))، 8 آیات | شہر
یہ خط 8 آیات پر مشتمل ہے، جس میں مدنی خطوط کا گروپ بھی شامل ہے جو خط النسا کے بعد نازل ہوا ہے۔ زلزال کا نام اس لفظ سے لیا گیا ہے: زلزال اس حرف کی پہلی آیت میں موجود ہے جس کا مطلب ہے ہلنا۔

100. سورۃ الادیات (سورۃ العدیات (د چارجرز) 11 آیات | مکہ
یہ سورت 11 آیات پر مشتمل ہے جس میں مکی سورتوں کا گروپ بھی شامل ہے جو سورۃ العشر کے بعد نازل ہوئی ہیں۔ العادیات کا نام اس سورہ کی پہلی آیت میں موجود لفظ العادیات سے لیا گیا ہے جس کا مطلب ہے تیز دوڑنے والا۔

101. سورۃ القراء (سورۃ القریٰ (روز قیامت آفت))، 11 آیات | مکہ
یہ خط 11 آیات پر مشتمل ہے جس میں مکی خطوط کا گروپ بھی شامل ہے جو قریش کے خط کے بعد نازل ہوئے تھے۔ القاریۃ کا نام پہلی آیت میں پائے جانے والے لفظ القاریۃ سے لیا گیا ہے جس کا مطلب ہے سخت دستک دینا، پھر یہ لفظ قیامت کے نام کے لیے استعمال ہوا۔

102. سورت التکاسور (سورہ التکاسور (برمیحہ-میغان مقابلہ))، 8 آیات | مکہ
سورت تاکاتسور 8 آیات پر مشتمل ہے، جس میں مکی سورتوں کا گروپ بھی شامل ہے، جو سورۃ الکوثر کے بعد نازل ہوئی ہیں۔ اس خط کی پہلی آیت میں پائے جانے والے لفظ At Takaatsur سے لیا گیا At Takaatsur (فخر)۔

103. سورۃ العصر (سورۃ العصر (عصر زوال کا دن، عہد)، 3 آیات | مکہ
سورۃ العشر 3 آیات پر مشتمل ہے جن میں مکی سورتوں کا گروپ بھی شامل ہے جو سورۃ عالم ناصرہ کے بعد نازل ہوئی ہیں۔ اس سورہ کی پہلی آیت میں موجود لفظ العشر سے لیا گیا ہے جس کا نام العشر (وقت) ہے۔

104. سورہ الحمزة (سورہ حمزہ)، 9 آیات | مکہ
سورہ حمزہ 9 آیات پر مشتمل ہے، جس میں مکی سورتوں کا گروپ بھی شامل ہے، جو سورۃ القیامہ کے بعد نازل ہوئی ہیں۔ اس خط کی پہلی آیت میں پائے جانے والے لفظ حمزہ سے لیا گیا الحمزہ ( بہتان کرنے والا) کا نام۔

105. سورہ الفیل (سورہ الفیل)، 5 آیات | مکہ
یہ سورت 5 آیات پر مشتمل ہے جس میں مکی سورتوں کا گروپ بھی شامل ہے جو سورہ کافرون کے بعد نازل ہوئی ہیں۔ الفیل نام اس سورہ کی پہلی آیت میں پائے جانے والے لفظ الفیل سے لیا گیا ہے جس کا مطلب ہاتھی ہے۔ سورت الفیل میں یمن سے ہاتھیوں کی ایک فوج کی کہانی بیان کی گئی ہے جس کی قیادت ابرہہ کر رہے تھے جو مکہ میں کعبہ کو تباہ کرنا چاہتے تھے۔ یہ واقعہ رسول اللہ صلی اللہ علیہ وسلم کے سال کا ہے۔ پیدا ہوا تھا

106. سورہ قریش (سورہ قریش)، 4 آیات | مکہ
یہ خط 4 آیات پر مشتمل ہے جس میں مکیہ خطوط کا گروپ بھی شامل ہے اور یہ خط التین کے بعد نازل ہوا ہے۔ قریش کا نام پہلی آیت میں پائے جانے والے لفظ قریش سے لیا گیا ہے جس کا مطلب ہے قریش کا قبیلہ۔ قبیلہ قریش وہ قبیلہ ہے جسے خانہ کعبہ کی حفاظت کا اعزاز حاصل ہے۔

107. سورت الماعون (سورۃ الماعون (خیرات کے لیے مفید اشیاء))، 7 آیات | مکہ
یہ خط 7 آیات پر مشتمل ہے، جس میں مکیہ خطوط کا گروپ بھی شامل ہے، جو خط تکتسور کے بعد نازل ہوا ہے۔ المعون کا نام آیت 7 میں موجود لفظ المعون سے لیا گیا ہے جس کا مطلب ہے مفید اشیاء۔

108. سورۃ الکوثر (سورۃ الکوثر)، 3 آیات | مکہ
سورۃ الکوثر 3 آیات پر مشتمل ہے جن میں مکی سورتوں کا گروپ بھی شامل ہے جو سورۃ العادیات کے بعد نازل ہوئی ہیں۔ اس خط کی پہلی آیت میں موجود لفظ الکوثر سے لیا گیا الکوثر (کثرت احسان) یہ خط رسول اللہ صلی اللہ علیہ وسلم کے دل کو تسلی دینے والا ہے۔

109. سورت الکافرون (سورۃ الکافرون)، 6 آیات | مکہ
سورۃ الکافرون 6 آیات پر مشتمل ہے، جس میں مکی سورتوں کا گروپ بھی شامل ہے، جو سورۃ الماعون کے بعد نازل ہوئی ہیں۔ اس سورہ کی پہلی آیت میں پائے جانے والے لفظ کافرون سے لیا گیا ہے، جس کا نام الکافیرون (کافر) ہے۔

110. سورۃ النصر (سورۃ النصر (الٰہی تائید))، 3 آیات | شہر
سورۃ النشر 3 آیات پر مشتمل ہے جن میں مدنی سورتوں کا گروپ بھی شامل ہے جو مکہ میں سورۃ التوبہ کے بعد نازل ہوئیں۔  اس خط کی پہلی آیت میں پائے جانے والے لفظ نشر سے لیا گیا ایک نشر (مدد) کا نام ہے۔

111. سورۃ المسد (سورۃ اللھب (ہنگامہ خیز آگ کھجور کا ریشہ))، 5 آیات | مکہ
یہ سورت 5 آیات پر مشتمل ہے جس میں مکی سورتوں کا گروپ بھی شامل ہے جو سورہ فتح کے بعد نازل ہوئی ہیں۔ اللھب کا نام اس سورہ کی تیسری آیت میں پائے جانے والے لفظ اللھب سے لیا گیا ہے جس کا مطلب ہے آگ کی ہلچل۔ اس خط کو المساد کا خط بھی کہا جاتا ہے۔

112. سورہ اخلاص (سورہ اخلاص)، 4 آیات | مکہ
یہ سورت 4 آیات پر مشتمل ہے جن میں مکی سورتوں کا گروپ بھی شامل ہے جو سورہ ناس کے بعد نازل ہوئی ہیں۔ اخلاص کا نام دیا گیا کیونکہ یہ خط خدا کی وحدانیت کی مکمل تصدیق کرتا ہے۔

113. سورۃ الفلق (سورۃ الفلق) 5 آیات | مکہ
یہ سورت 5 آیات پر مشتمل ہے جس میں مکی سورتوں کا گروپ بھی شامل ہے جو سورہ الفیل کے بعد نازل ہوئی ہیں۔ الفلق کا نام اس سورہ کی پہلی آیت میں پائے جانے والے لفظ الفلق سے لیا گیا ہے جس کا مطلب طلوع فجر ہے۔ ابو داؤد، ترمذی اور نسائی نے عقبہ بن عامر سے روایت کی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے راستے میں سورۃ الفلق اور سورۃ الناس پڑھ کر دعا کریں۔

114. سورۃ الناس (سورۃ الناس)، 6 آیات | مکہ
یہ سورت 6 آیات پر مشتمل ہے، جس میں مکی سورتوں کا گروپ بھی شامل ہے، جو سورۃ الفلق کے بعد نازل ہوئی ہیں۔ ان ناس نام آن ناس سے لیا گیا ہے جس کا بار بار اس خط میں ذکر آیا ہے جس کا مطلب ہے انسان۔



`
    if (!(args[0] || args[1])) throw `${daftarsurah}`;
    if (isNaN(args[0]) || isNaN(args[1])) throw `${daftarsurah}`;

    /*
    if (!(args[0] || args[1])) throw `contoh:\n${usedPrefix + command} 1 2\n\nmaka hasilnya adalah surah Al-Fatihah ayat 2 beserta audionya, & ayatnya 1 saja.`;
    if (isNaN(args[0]) || isNaN(args[1])) throw `contoh:\n${usedPrefix + command} 1 2\n\nmaka hasilnya adalah surah Al-Fatihah ayat 2 beserta audionya, dan ayatnya 1 saja\n`;
    */
    let retries = 0;
    let api;

    while (retries < maxRetries) {
        try {
            const response = await fetch('https://raw.githubusercontent.com/Xnuvers007/Xnuvers007.github.io/master/database/alquran.json');
            if (!response.ok) throw 'Unable to retrieve Al-Quran data.';
            api = await response.json();
            break; // berhenti kalo udah berhasil
        } catch (error) {
            console.error(`Error fetching data (attempt ${retries + 1}):`, error);
            retries++;
            await new Promise(resolve => setTimeout(resolve, retryDelay)); // jeda dulu sebelum coba lagi
        }
    }

    if (retries === maxRetries) {
        throw 'Failed to retrieve the Quran data after several attempts.';
    }

    if (!Array.isArray(api)) {
        throw `The Qur'anic data is not in accordance with the expected format.`;
    }

    /*
    const surahList = api.map(surah => {
        let name = `${surah.asma.id.long} (${surah.asma.translation.id + " " + surah.asma.translation.en})`;
        return `${surah.number}. Surat ${surah.asma.ar.short} (${name}), ${surah.ayahCount + " ayat" + " | " + surah.type.ar}\n${surah.tafsir.id}`;
    }).join('\n\n');

    const listsurah = `Nama-nama Surah:\n${surahList}`;

    if (!(args[0] || args[1])) throw `contoh:\n${usedPrefix + command} 1 2\n\nmaka hasilnya adalah surah Al-Fatihah ayat 2 beserta audionya, & ayatnya 1 saja\n\n${listsurah}`;98. سورۃ البیینۃ (سورۃ البیینۃ)، 8 آیات | شہر

    if (isNaN(args[0]) || isNaN(args[1])) throw `contoh:\n${usedPrefix + command} 1 2\n\nmaka hasilnya adalah surah Al-Fatihah ayat 2 beserta audionya, dan ayatnya 1 aja\n\n${listsurah}`;
    */

    await m.reply(wait);

    const mes = `💞𝗔𝗟-𝗤𝗨𝗥𝗔𝗡💞\n
*${api[args[0] - 1].ayahs[args[1] - 1].text.ar}*
${api[args[0] - 1].ayahs[args[1] - 1].text.read}
        
English: ${api[args[0] - 1].ayahs[args[1] - 1].translation.en}

( Q.S ${api[args[0] - 1].asma.id.short} (${api[args[0] - 1].asma.ar.short}) : ${api[args[0] - 1].ayahs[args[1] - 1].number.insurah} )
  
*Tafsir: ${api[args[0] - 1].ayahs[args[1] - 1].tafsir.id}*
`.trim();
    await m.reply(mes);
    await conn.sendFile(m.chat, api[args[0] - 1].ayahs[args[1] - 1].audio.url, '', `( Q.S ${api[args[0] - 1].asma.id.short} (${api[args[0] - 1].asma.ar.short}) : ${api[args[0] - 1].ayahs[args[1] - 1].number.insurah} )`, m);
}

handler.help = ['alquran']
handler.tags = ['quran']
handler.command = ['alquran']

export default handler;
